Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/AdminCourierResources.*.resx
Languages: tr

source: Courier not found
tr: Kurye bulunamadı

# OrderAssignmentFailed
source: Order could not be assigned. Make sure the order is in ready status and the courier is available
tr: Sipariş atanamadı. Siparişin hazır durumda olduğundan ve kuryenin müsait olduğundan emin olun

# CannotDeactivateWithActiveOrders
source: Courier with active orders cannot be deactivated
tr: Aktif siparişi olan kurye pasifleştirilemez

source: Invalid status
tr: Geçersiz durum

source: Couriers retrieved successfully
tr: Kuryeler başarıyla getirildi

source: Order assigned successfully
tr: Sipariş başarıyla atandı

# PerformanceStatisticsRetrievedSuccessfully
source: Courier performance statistics retrieved successfully
tr: Kurye performans istatistikleri başarıyla getirildi

source: Courier activated successfully
tr: Kurye başarıyla aktifleştirildi

source: Courier deactivated successfully
tr: Kurye başarıyla pasifleştirildi

# CourierStatusUpdated
source: Courier status updated to {0}
tr: Kurye durumu {0} olarak güncellendi

# OverallStatisticsRetrievedSuccessfully
source: Overall courier statistics retrieved successfully
tr: Genel kurye istatistikleri başarıyla getirildi
