Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/AuthResources.*.resx
Languages: ar, tr

# DuplicateEmail
source: An account with this email address already exists.
ar: يوجد بالفعل حساب بهذا العنوان الإلكتروني.
tr: Bu email adresi ile zaten bir hesap bulunmaktadır.

# EmailSendFailed
source: Failed to send verification code. Please try again later.
ar: فشل إرسال رمز التحقق. يرجى المحاولة مرة أخرى لاحقًا.
tr: Doğrulama kodu gönderilemedi. Lütfen daha sonra tekrar deneyin.

# EmailSendFailedWithDetails
source: Failed to send verification code. Please check your email address or try again later.
ar: فشل إرسال رمز التحقق. يرجى التحقق من عنوان بريدك الإلكتروني أو المحاولة مرة أخرى لاحقًا.
tr: Doğrulama kodu gönderilemedi. Lütfen email adresinizi kontrol edin veya daha sonra tekrar deneyin.

source: User creation failed
ar: فشل إنشاء المستخدم
tr: Kullanıcı oluşturulamadı

# UserCreationError
source: An error occurred while creating the user. Please try again.
ar: حدث خطأ أثناء إنشاء المستخدم. يرجى المحاولة مرة أخرى.
tr: Kullanıcı oluşturulurken bir hata oluştu. Lütfen tekrar deneyin.

# RegistrationError
source: An error occurred during registration
ar: حدث خطأ أثناء التسجيل
tr: Kayıt sırasında bir hata oluştu

# VendorCreationFailed
source: Vendor account creation failed
ar: فشل إنشاء حساب البائع
tr: Satıcı hesabı oluşturulamadı

# VendorCreationError
source: An error occurred while creating the vendor account. Please try again.
ar: حدث خطأ أثناء إنشاء حساب البائع. يرجى المحاولة مرة أخرى.
tr: Satıcı hesabı oluşturulurken bir hata oluştu. Lütfen tekrar deneyin.

# CourierCreationFailed
source: Courier account creation failed
ar: فشل إنشاء حساب السائق
tr: Kurye hesabı oluşturulamadı

# CourierCreationError
source: An error occurred while creating the courier account. Please try again.
ar: حدث خطأ أثناء إنشاء حساب السائق. يرجى المحاولة مرة أخرى.
tr: Kurye hesabı oluşturulurken bir hata oluştu. Lütfen tekrar deneyin.

source: User not found.
ar: المستخدم غير موجود.
tr: Kullanıcı bulunamadı.

# EmailAlreadyConfirmed
source: Email address is already confirmed.
ar: تم تأكيد عنوان البريد الإلكتروني بالفعل.
tr: Email adresi zaten doğrulanmış.

# CodeExpired
source: Verification code has expired or is invalid.
ar: انتهت صلاحية رمز التحقق أو أنه غير صالح.
tr: Doğrulama kodu süresi dolmuş veya geçersiz.

# InvalidCode
source: Invalid verification code.
ar: رمز التحقق غير صحيح.
tr: Doğrulama kodu hatalı.

source: Email verification failed.
ar: فشل التحقق من البريد الإلكتروني.
tr: Email doğrulama başarısız.

# VerificationError
source: An error occurred during verification
ar: حدث خطأ أثناء التحقق
tr: Doğrulama sırasında bir hata oluştu

# CodeResendError
source: An error occurred while resending the code
ar: حدث خطأ أثناء إعادة إرسال الرمز
tr: Kod gönderme sırasında bir hata oluştu

# InvalidCredentials
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة
tr: Geçersiz email veya şifre

# EmailNotConfirmed
source: Email not confirmed. Please check your email.
ar: لم يتم تأكيد البريد الإلكتروني. يرجى التحقق من بريدك الإلكتروني.
tr: Email doğrulanmadı. Lütfen email'inizi kontrol edin.

# PasswordNotSet
source: Account password not set. Please reset your password.
ar: لم يتم تعيين كلمة مرور الحساب. يرجى إعادة تعيين كلمة المرور.
tr: Hesap şifresi ayarlanmamış. Lütfen şifrenizi sıfırlayın.

# LoginSuccess
source: Login successful
ar: تم تسجيل الدخول بنجاح
tr: Giriş başarılı

# LoginError
source: An error occurred during login
ar: حدث خطأ أثناء تسجيل الدخول
tr: Giriş sırasında bir hata oluştu

# PasswordCorrupted
source: Account password is corrupted. Please contact support or register a new account.
ar: كلمة مرور الحساب تالفة. يرجى الاتصال بالدعم أو إنشاء حساب جديد.
tr: Hesap şifresi bozuk. Lütfen destek ile iletişime geçin veya yeni bir hesap oluşturun.

# InvalidRequest
source: Invalid client request
ar: طلب غير صالح
tr: Geçersiz istek

# InvalidToken
source: Invalid access token or refresh token
ar: رمز الوصول أو رمز التحديث غير صالح
tr: Geçersiz erişim token'ı veya yenileme token'ı

# TokenRefreshSuccess
source: Token successfully refreshed
ar: تم تحديث الرمز بنجاح
tr: Token başarıyla yenilendi

source: Invalid provider
ar: مزود غير صالح
tr: Geçersiz sağlayıcı

# EmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب
tr: Email gereklidir

# ExternalLoginError
source: External login failed
ar: فشل تسجيل الدخول عبر وسائل التواصل الاجتماعي
tr: Sosyal medya girişi başarısız

# VerificationCodeSent
source: A new verification code has been sent to your email address. Please check your email.
ar: تم إرسال رمز تحقق جديد إلى عنوان بريدك الإلكتروني. يرجى التحقق من بريدك الإلكتروني.
tr: Email adresinize yeni doğrulama kodu gönderildi. Lütfen email'inizi kontrol edin.

# UserCreatedSuccessfully
source: User created successfully. Please enter the 4-digit code sent to your email address.
ar: تم إنشاء المستخدم بنجاح. يرجى إدخال الرمز المكون من 4 أرقام المرسل إلى عنوان بريدك الإلكتروني.
tr: Kullanıcı başarıyla oluşturuldu. Email adresinize gönderilen 4 haneli kodu giriniz.

# VendorCreatedSuccessfully
source: Vendor account created successfully. Please enter the 4-digit code sent to your email address.
ar: تم إنشاء حساب البائع بنجاح. يرجى إدخال الرمز المكون من 4 أرقام المرسل إلى عنوان بريدك الإلكتروني.
tr: Satıcı hesabı başarıyla oluşturuldu. Email adresinize gönderilen 4 haneli kodu giriniz.

# CourierCreatedSuccessfully
source: Courier account created successfully. Please enter the 4-digit code sent to your email address.
ar: تم إنشاء حساب السائق بنجاح. يرجى إدخال الرمز المكون من 4 أرقام المرسل إلى عنوان بريدك الإلكتروني.
tr: Kurye hesabı başarıyla oluşturuldu. Email adresinize gönderilen 4 haneli kodu giriniz.

# EmailVerifiedSuccessfully
source: Email address successfully verified.
ar: تم التحقق من عنوان البريد الإلكتروني بنجاح.
tr: Email adresi başarıyla doğrulandı.

# CodeResentSuccessfully
source: Verification code resent successfully.
ar: تم إعادة إرسال رمز التحقق بنجاح.
tr: Doğrulama kodu yeniden gönderildi.

# CodeResentMessage
source: If this email address is registered, a verification code has been sent.
ar: إذا كان هذا العنوان الإلكتروني مسجلاً، تم إرسال رمز التحقق.
tr: Eğer bu email adresi kayıtlıysa, doğrulama kodu gönderildi.

# PasswordResetSent
source: If the email exists, a password reset link has been sent.
ar: إذا كان البريد الإلكتروني موجودًا، تم إرسال رابط إعادة تعيين كلمة المرور.
tr: Eğer email kayıtlıysa, şifre sıfırlama linki gönderildi.

# PasswordTooShort
source: Password must be at least {0} characters long.
ar: يجب أن تكون كلمة المرور على الأقل {0} أحرف.

# PasswordRequiresDigit
source: Password must contain at least one digit (0-9).
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل (0-9).

# PasswordRequiresLowercase
source: Password must contain at least one lowercase letter (a-z).
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل (a-z).

# PasswordRequiresUppercase
source: Password must contain at least one uppercase letter (A-Z).
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل (A-Z).

# PasswordRequiresNonAlphanumeric
source: Password must contain at least one special character (!@#$%^&* etc.).
ar: يجب أن تحتوي كلمة المرور على حرف خاص واحد على الأقل (!@#$%^&* إلخ).

# PasswordSameAsCurrent
source: New password must be different from current password.
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن كلمة المرور الحالية.

# EmailVerificationSubject
source: Talabi - Email Verification Code
ar: Talabi - رمز التحقق من البريد الإلكتروني
tr: Talabi - Email Doğrulama Kodu
