Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/CourierResources.*.resx
Languages: ar, tr

source: Courier profile not found
ar: ملف الساعي غير موجود
tr: Kurye profili bulunamadı

source: Courier profile retrieved successfully
ar: تم استرجاع ملف الساعي بنجاح
tr: Kurye profili başarıyla getirildi

source: Invalid vehicle type
ar: نوع المركبة غير صالح
tr: Geçersiz araç tipi

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح
tr: Profil başarıyla güncellendi

# VehicleTypeMotorcycle
source: Motorcycle
ar: دراجة نارية
tr: Motosiklet

# VehicleTypeCar
source: Car
ar: سيارة
tr: Araba

# VehicleTypeBicycle
source: Bicycle
ar: دراجة هوائية
tr: Bisiklet

source: Vehicle types retrieved successfully
ar: تم استرجاع أنواع المركبات بنجاح
tr: Araç tipleri başarıyla getirildi

source: Invalid status
ar: حالة غير صالحة
tr: Geçersiz durum

source: Cannot go available outside working hours
ar: لا يمكن أن تكون متاحًا خارج ساعات العمل
tr: Çalışma saatleri dışında uygun duruma geçilemez

source: Cannot go offline with active orders
ar: لا يمكن الخروج مع وجود طلبات نشطة
tr: Aktif siparişler varken çevrimdışı olunamaz

# StatusUpdated
source: Status updated to {0}
ar: تم تحديث الحالة إلى {0}
tr: Durum {0} olarak güncellendi

source: Invalid latitude
ar: خط عرض غير صالح
tr: Geçersiz enlem

source: Invalid longitude
ar: خط طول غير صالح
tr: Geçersiz boylam

source: Location updated successfully
ar: تم تحديث الموقع بنجاح
tr: Konum başarıyla güncellendi

source: Courier statistics retrieved successfully
ar: تم استرجاع إحصائيات الساعي بنجاح
tr: Kurye istatistikleri başarıyla getirildi

source: Availability checked successfully
ar: تم التحقق من التوفر بنجاح
tr: Müsaitlik durumu başarıyla kontrol edildi

source: Courier not found
ar: الساعي غير موجود
tr: Kurye bulunamadı

# NotAuthorizedForThisCourier
source: You are not authorized for this courier
ar: ليس لديك صلاحية لهذا الساعي
tr: Bu kurye için yetkiniz yok

source: Courier location not found
ar: موقع الساعي غير موجود
tr: Kurye konumu bulunamadı

source: Courier location retrieved successfully
ar: تم استرجاع موقع الساعي بنجاح
tr: Kurye konumu başarıyla getirildi

source: Active couriers retrieved successfully
ar: تم استرجاع السعاة النشطين بنجاح
tr: Aktif kuryeler başarıyla getirildi

source: Active orders retrieved successfully
ar: تم استرجاع الطلبات النشطة بنجاح
tr: Aktif siparişler başarıyla getirildi

source: Failed to accept order
ar: فشل قبول الطلب
tr: Sipariş kabul edilemedi

source: Order accepted successfully
ar: تم قبول الطلب بنجاح
tr: Sipariş başarıyla kabul edildi

source: Reject reason must be at least 10 characters
ar: يجب أن يكون سبب الرفض 10 أحرف على الأقل
tr: Reddetme sebebi en az 10 karakter olmalıdır

source: Failed to reject order
ar: فشل رفض الطلب
tr: Sipariş reddedilemedi

source: Order rejected successfully
ar: تم رفض الطلب بنجاح
tr: Sipariş başarıyla reddedildi

source: Failed to pick up order
ar: فشل استلام الطلب
tr: Sipariş teslim alınamadı

source: Order picked up successfully
ar: تم استلام الطلب بنجاح
tr: Sipariş başarıyla teslim alındı

source: Failed to deliver order
ar: فشل توصيل الطلب
tr: Sipariş teslim edilemedi

source: Order delivered successfully
ar: تم توصيل الطلب بنجاح
tr: Sipariş başarıyla teslim edildi

# OrderNotFoundOrNotAssigned
source: Order not found or not assigned to you
ar: الطلب غير موجود أو غير مخصص لك
tr: Sipariş bulunamadı veya size atanmamış

source: Order must be delivered before submitting proof
ar: يجب توصيل الطلب قبل تقديم الإثبات
tr: Kanıt göndermeden önce sipariş teslim edilmelidir

source: Delivery proof submitted successfully
ar: تم تقديم إثبات التسليم بنجاح
tr: Teslimat kanıtı başarıyla gönderildi

source: Order history retrieved successfully
ar: تم استرجاع سجل الطلبات بنجاح
tr: Sipariş geçmişi başarıyla getirildi

source: Order details retrieved successfully
ar: تم استرجاع تفاصيل الطلب بنجاح
tr: Sipariş detayları başarıyla getirildi

# TodayEarningsRetrievedSuccessfully
source: Today's earnings retrieved successfully
ar: تم استرجاع أرباح اليوم بنجاح
tr: Bugünkü kazançlar başarıyla getirildi

# WeekEarningsRetrievedSuccessfully
source: Weekly earnings retrieved successfully
ar: تم استرجاع الأرباح الأسبوعية بنجاح
tr: Haftalık kazançlar başarıyla getirildi

# MonthEarningsRetrievedSuccessfully
source: Monthly earnings retrieved successfully
ar: تم استرجاع الأرباح الشهرية بنجاح
tr: Aylık kazançlar başarıyla getirildi

source: Earnings history retrieved successfully
ar: تم استرجاع سجل الأرباح بنجاح
tr: Kazanç geçmişi başarıyla getirildi
