Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/OrderResources.*.resx
Languages: ar, tr

source: Vendor not found
ar: البائع غير موجود
tr: Satıcı bulunamadı

# ProductNotFound
source: Product {0} not found
ar: المنتج {0} غير موجود
tr: Ürün {0} bulunamadı

source: Order not found
ar: الطلب غير موجود
tr: Sipariş bulunamadı

source: Order item not found
ar: عنصر الطلب غير موجود
tr: Sipariş ürünü bulunamadı

# Unauthorized
source: Authorization required
ar: التفويض مطلوب
tr: Yetkilendirme gerekli

source: Invalid status
ar: حالة غير صالحة
tr: Geçersiz durum

# InvalidStatusTransition
source: Cannot transition from {0} to {1}
ar: لا يمكن الانتقال من {0} إلى {1}
tr: {0} durumundan {1} durumuna geçiş yapılamaz

source: Order cannot be cancelled
ar: لا يمكن إلغاء الطلب
tr: Sipariş iptal edilemez

# InvalidCancellationStatus
source: Order can only be cancelled when in Pending or Preparing status
ar: يمكن إلغاء الطلب فقط عندما يكون في حالة الانتظار أو التحضير
tr: Sipariş sadece Beklemede veya Hazırlanıyor durumundayken iptal edilebilir

# InvalidCancellationReason
source: Cancellation reason must be at least 10 characters
ar: يجب أن يكون سبب الإلغاء 10 أحرف على الأقل
tr: İptal sebebi en az 10 karakter olmalıdır

# OrderItemInvalidCancellationStatus
source: Order items can only be cancelled when order is in Pending or Preparing status
ar: يمكن إلغاء عناصر الطلب فقط عندما يكون الطلب في حالة الانتظار أو التحضير
tr: Sipariş ürünleri sadece Beklemede veya Hazırlanıyor durumundayken iptal edilebilir

# AlreadyCancelled
source: Order item is already cancelled
ar: تم إلغاء عنصر الطلب بالفعل
tr: Sipariş ürünü zaten iptal edilmiş

# Forbidden
source: You do not have permission to cancel this order item
ar: ليس لديك إذن لإلغاء عنصر الطلب هذا
tr: Bu sipariş ürününü iptal etme yetkiniz yok

# ConcurrencyConflict
source: Order was modified by another user. Please refresh and try again.
ar: تم تعديل الطلب من قبل مستخدم آخر. يرجى التحديث والمحاولة مرة أخرى.
tr: Sipariş başka bir kullanıcı tarafından değiştirildi. Lütfen yenileyin ve tekrar deneyin.

# OrderCreationFailed
source: An error occurred while creating the order
ar: حدث خطأ أثناء إنشاء الطلب
tr: Sipariş oluşturulurken bir hata oluştu

# OrderCancellationFailed
source: An error occurred while cancelling the order
ar: حدث خطأ أثناء إلغاء الطلب
tr: Sipariş iptal edilirken bir hata oluştu

# OrderItemCancellationFailed
source: An error occurred while cancelling the order item
ar: حدث خطأ أثناء إلغاء عنصر الطلب
tr: Sipariş ürünü iptal edilirken bir hata oluştu

source: Order created successfully
ar: تم إنشاء الطلب بنجاح
tr: Sipariş başarıyla oluşturuldu

source: Order retrieved successfully
ar: تم جلب الطلب بنجاح
tr: Sipariş başarıyla getirildi

source: Orders retrieved successfully
ar: تم جلب الطلبات بنجاح
tr: Siparişler başarıyla getirildi

source: Order detail retrieved successfully
ar: تم جلب تفاصيل الطلب بنجاح
tr: Sipariş detayı başarıyla getirildi

source: Order status updated successfully
ar: تم تحديث حالة الطلب بنجاح
tr: Sipariş durumu başarıyla güncellendi

source: Order cancelled successfully
ar: تم إلغاء الطلب بنجاح
tr: Sipariş başarıyla iptal edildi

source: Order item cancelled successfully
ar: تم إلغاء عنصر الطلب بنجاح
tr: Sipariş ürünü başarıyla iptal edildi

# NewOrderTitle
source: New Order
ar: طلب جديد
tr: Yeni Sipariş

# NewOrderMessage
source: New order #Order.{0} received. Total: ${1}
ar: تم استلام طلب جديد #Order.{0}. الإجمالي: {1}
tr: #Order.{0} numaralı yeni sipariş alındı. Toplam: ₺{1}

# OrderCreatedTitle
source: Order Created
ar: تم إنشاء الطلب
tr: Sipariş Oluşturuldu

# OrderCreatedMessage
source: Your order #{0} has been created successfully. Total: ${1}
ar: تم إنشاء طلبك #{0} بنجاح. الإجمالي: {1}
tr: #{0} numaralı siparişiniz başarıyla oluşturuldu. Toplam: ₺{1}

# OrderStatusChangedTitle
source: Order Status Updated
ar: تم تحديث حالة الطلب
tr: Sipariş Durumu Güncellendi

# OrderStatusChangedMessage
source: Order #Order.{0}: {1}
ar: الطلب #Order.{0}: {1}
tr: #Order.{0} numaralı sipariş: {1}

# OrderCancelledTitle
source: Order Cancelled
ar: تم إلغاء الطلب
tr: Sipariş İptal Edildi

# OrderCancelledMessage
source: Your order #{0} has been cancelled. Reason: {1}
ar: تم إلغاء طلبك #{0}. السبب: {1}
tr: #{0} numaralı siparişiniz iptal edildi. Sebep: {1}

# OrderItemCancelledTitle
source: Order Item Cancelled
ar: تم إلغاء عنصر الطلب
tr: Sipariş Ürünü İptal Edildi

# OrderItemCancelledMessage
source: Item #{0} has been cancelled from your order. Reason: {1}
ar: تم إلغاء العنصر #{0} من طلبك. السبب: {1}
tr: #{0} numaralı ürün siparişinizden iptal edildi. Sebep: {1}

# StatusPreparing
source: Your order is being prepared
ar: يتم تحضير طلبك
tr: Siparişiniz hazırlanıyor

# StatusReady
source: Your order is ready, courier is being assigned
ar: طلبك جاهز، يتم تعيين كوريير
tr: Siparişiniz hazır, kurye atanıyor

# StatusAssigned
source: A courier has been assigned to your order
ar: تم تعيين كوريير لطلبك
tr: Siparişinize kurye atandı

# StatusAccepted
source: Courier has accepted the order
ar: قبل الكوريير الطلب
tr: Kurye siparişi kabul etti

# StatusOutForDelivery
source: Your order is on the way
ar: طلبك في الطريق
tr: Siparişiniz yola çıktı

# StatusDelivered
source: Your order has been delivered
ar: تم تسليم طلبك
tr: Siparişiniz teslim edildi

# StatusCancelled
source: Your order has been cancelled
ar: تم إلغاء طلبك
tr: Siparişiniz iptal edildi

# StatusUpdated
source: Order status updated
ar: تم تحديث حالة الطلب
tr: Sipariş durumu güncellendi
