Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/OrderAssignmentResources.*.resx
Languages: ar, tr

source: New order assigned
ar: تم تعيين طلب جديد
tr: Yeni sipariş atandı

# OrderAssignedMessage
source: Order #{0} has been assigned to you. Please review and take action quickly.
ar: تم تعيين الطلب #{0} لك. يرجى المراجعة واتخاذ إجراء بسرعة.
tr: #{0} numaralı sipariş sana atandı. İnceleyip hızlıca aksiyon al.

source: Order out for delivery
ar: الطلب في الطريق للتسليم
tr: Sipariş teslimata çıktı

# OrderOutForDeliveryMessage
source: Order #{0} has left for customer delivery.
ar: الطلب #{0} قد غادر لتسليمه للعميل.
tr: #{0} numaralı sipariş müşteriye teslim edilmek üzere yola çıktı.

source: Delivery completed
ar: اكتمل التسليم
tr: Teslimat tamamlandı

# DeliveryCompletedMessage
source: Congratulations! You have successfully delivered order #{0}.
ar: تهانينا! لقد قمت بتسليم الطلب #{0} بنجاح.
tr: Tebrikler! #{0} numaralı siparişi başarıyla teslim ettin.

source: Order On The Way
ar: الطلب في الطريق
tr: Sipariş Yola Çıktı

# OrderOnTheWayMessage
source: Your order #{0} has left for delivery.
ar: طلبك #{0} قد غادر للتسليم.
tr: #{0} numaralı siparişiniz teslim edilmek üzere yola çıktı.

source: Order Delivered
ar: تم تسليم الطلب
tr: Sipariş Teslim Edildi

# OrderDeliveredMessage
source: Your order #{0} has been successfully delivered. Enjoy your meal!
ar: تم تسليم طلبك #{0} بنجاح. بالهناء والشفاء!
tr: #{0} numaralı siparişiniz başarıyla teslim edildi. Afiyet olsun!

source: Courier Rejected Order
ar: رفض الكوريير الطلب
tr: Kurye Siparişi Reddetti

# CourierRejectedOrderMessage
source: Order #Order.{0} was rejected by {1}. Reason: {2}. Order has been set back to Ready status.
ar: تم رفض الطلب #Order.{0} من قبل {1}. السبب: {2}. تم إعادة الطلب إلى حالة جاهز.
tr: #Order.{0} numaralı sipariş {1} tarafından reddedildi. Sebep: {2}. Sipariş yeniden Hazır durumuna alındı.
