Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/ReviewResources.*.resx
Languages: ar, tr

# UserIdentityNotFound
source: User identity could not be determined
ar: تعذر تحديد هوية المستخدم
tr: Kullanıcı kimliği belirlenemedi

source: User not found
ar: المستخدم غير موجود
tr: Kullanıcı bulunamadı

source: Product not found
ar: المنتج غير موجود
tr: Ürün bulunamadı

source: Vendor not found
ar: البائع غير موجود
tr: Satıcı bulunamadı

# VendorNotFoundForUser
source: Vendor not found for this user
ar: البائع غير موجود لهذا المستخدم
tr: Bu kullanıcı için satıcı bulunamadı

source: Review not found
ar: التقييم غير موجود
tr: Değerlendirme bulunamadı

# ReviewAlreadyExists
source: You have already reviewed this product. You cannot create another review.
ar: لقد قمت بتقييم هذا المنتج بالفعل. لا يمكنك إنشاء تقييم آخر.
tr: Bu ürüne zaten değerlendirme yaptınız. Başka bir değerlendirme oluşturamazsınız.

# VendorReviewAlreadyExists
source: You have already reviewed a product from this vendor. You cannot create another review.
ar: لقد قمت بتقييم منتج من هذا البائع بالفعل. لا يمكنك إنشاء تقييم آخر.
tr: Bu satıcının bir ürününe zaten değerlendirme yaptınız. Başka bir değerlendirme oluşturamazsınız.

# VendorHasNoProducts
source: Vendor has no products. Vendor review cannot be created without products.
ar: البائع ليس لديه منتجات. لا يمكن إنشاء تقييم للبائع بدون منتجات.
tr: Satıcının ürünü yok. Ürün olmadan satıcı değerlendirmesi oluşturulamaz.

# InvalidTargetType
source: Invalid target type. Must be 'Product' or 'Vendor'.
ar: نوع الهدف غير صالح. يجب أن يكون 'Product' أو 'Vendor'.
tr: Geçersiz hedef tipi. 'Product' veya 'Vendor' olmalıdır.

# ForbiddenApprove
source: Only the vendor owner can approve reviews for their own products or vendor.
ar: يمكن لمالك البائع فقط الموافقة على التقييمات لمنتجاتهم أو بائعهم.
tr: Sadece satıcı sahibi kendi ürünlerinin veya satıcısının değerlendirmelerini onaylayabilir.

# ForbiddenReject
source: Only the vendor owner can reject reviews for their own products or vendor.
ar: يمكن لمالك البائع فقط رفض التقييمات لمنتجاتهم أو بائعهم.
tr: Sadece satıcı sahibi kendi ürünlerinin veya satıcısının değerlendirmelerini reddedebilir.

source: Review created successfully
ar: تم إنشاء التقييم بنجاح
tr: Değerlendirme başarıyla oluşturuldu

source: Product reviews retrieved successfully
ar: تم جلب تقييمات المنتج بنجاح
tr: Ürün değerlendirmeleri başarıyla getirildi

source: Vendor reviews retrieved successfully
ar: تم جلب تقييمات البائع بنجاح
tr: Satıcı değerlendirmeleri başarıyla getirildi

source: Review approved successfully
ar: تم الموافقة على التقييم بنجاح
tr: Değerlendirme başarıyla onaylandı

# ReviewRejectedSuccessfully
source: Review rejected and deleted successfully
ar: تم رفض التقييم وحذفه بنجاح
tr: Değerlendirme başarıyla reddedildi ve silindi

source: Pending reviews retrieved successfully
ar: تم جلب التقييمات المعلقة بنجاح
tr: Bekleyen değerlendirmeler başarıyla getirildi
