Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/ValidationResources.*.resx
Languages: ar

# CampaignNotActive
source: Campaign is not active.
ar: الحملة غير نشطة.

# CampaignFirstOrderOnly
source: This campaign is only for first orders.
ar: هذه الحملة للطلبات الأولى فقط.

# CampaignExpiredOrNotStarted
source: Campaign is expired or not yet started.
ar: انتهت صلاحية الحملة أو لم تبدأ بعد.

source: Campaign not valid at this time.
ar: الحملة غير صالحة في هذا الوقت.

# CampaignNotValidInCity
source: Campaign not valid in this city.
ar: الحملة غير صالحة في هذه المدينة.

# CampaignNotValidInDistrict
source: Campaign not valid in this district.
ar: الحملة غير صالحة في هذه المنطقة.

# CampaignVendorTypeMismatch
source: Campaign not valid for these items (Vendor Type mismatch).
ar: الحملة غير صالحة لهذه العناصر (عدم تطابق نوع البائع).

# CampaignMinCartAmountRequired
source: Minimum cart amount of {0} required.
ar: الحد الأدنى لمبلغ سلة التسوق هو {0}.

source: Campaign requires specific products.
ar: تتطلب الحملة منتجات محددة.

# CouponNotActive
source: Coupon is not active.
ar: القسيمة غير نشطة.

# CouponFirstOrderOnly
source: This coupon is only for first orders.
ar: هذه القسيمة للطلبات الأولى فقط.

# CouponExpired
source: Coupon has expired.
ar: انتهت صلاحية القسيمة.

source: Coupon not valid at this time.
ar: القسيمة غير صالحة في هذا الوقت.

# CouponVendorTypeMismatch
source: Coupon not valid for these items (Vendor Type mismatch).
ar: القسيمة غير صالحة لهذه العناصر (عدم تطابق نوع البائع).

# CouponVendorMismatch
source: Coupon not valid for this vendor.
ar: القسيمة غير صالحة لهذا البائع.

# CouponNotValidInCity
source: Coupon not valid in this city.
ar: القسيمة غير صالحة في هذه المدينة.

# CouponNotValidInDistrict
source: Coupon not valid in this district.
ar: القسيمة غير صالحة في هذه المنطقة.

source: Coupon requires specific categories.
ar: تتطلب القسيمة فئات محددة.

source: Coupon requires specific products.
ar: تتطلب القسيمة منتجات محددة.

# CouponMinCartAmountRequired
source: Minimum cart amount of {0} required.
ar: الحد الأدنى لمبلغ سلة التسوق هو {0}.
