Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/VendorProfileResources.*.resx
Languages: ar

source: Vendor profile not found
ar: ملف البائع غير موجود

source: Vendor profile retrieved successfully
ar: تم استرجاع ملف البائع بنجاح

source: Invalid request
ar: طلب غير صالح

source: Vendor profile updated successfully
ar: تم تحديث ملف البائع بنجاح

# ErrorUpdatingVendorProfile
source: Error updating vendor profile: {0}
ar: حدث خطأ أثناء تحديث ملف البائع: {0}

# VendorImageUpdatedSuccessfully
source: Vendor profile image updated successfully
ar: تم تحديث صورة ملف البائع بنجاح

# ErrorUpdatingVendorImage
source: Error updating vendor image: {0}
ar: حدث خطأ أثناء تحديث صورة البائع: {0}

source: Vendor settings retrieved successfully
ar: تم استرجاع إعدادات البائع بنجاح

source: Vendor settings updated successfully
ar: تم تحديث إعدادات البائع بنجاح

# ErrorUpdatingVendorSettings
source: Error updating vendor settings: {0}
ar: حدث خطأ أثناء تحديث إعدادات البائع: {0}

source: Vendor active status updated successfully
ar: تم تحديث حالة نشاط البائع بنجاح

# ErrorUpdatingVendorActiveStatus
source: Error updating vendor active status: {0}
ar: حدث خطأ أثناء تحديث حالة نشاط البائع: {0}
