Repository: osmanaliaydemir/talabi
Catalog: src/Talabi.Api/Resources/VendorOrderResources.*.resx
Languages: ar, tr

source: Order not found
ar: الطلب غير موجود
tr: Sipariş bulunamadı

# NotAVendor
source: User is not a vendor
ar: المستخدم ليس بائعًا
tr: Kullanıcı bir satıcı değil

source: Invalid order status
ar: حالة الطلب غير صالحة
tr: Geçersiz sipariş durumu

# OrderCanOnlyBeAcceptedWhenPending
source: Order can only be accepted when in Pending status
ar: يمكن قبول الطلب فقط عندما يكون في حالة الانتظار
tr: Sipariş yalnızca Beklemede durumundayken kabul edilebilir

# OrderCanOnlyBeRejectedWhenPending
source: Order can only be rejected when in Pending status
ar: يمكن رفض الطلب فقط عندما يكون في حالة الانتظار
tr: Sipariş yalnızca Beklemede durumundayken reddedilebilir

# InvalidRejectionReason
source: Rejection reason must be at least 10 characters
ar: يجب أن يكون سبب الرفض 10 أحرف على الأقل
tr: Reddetme nedeni en az 10 karakter olmalıdır

# InvalidStatusTransition
source: Status cannot be changed from {0} to {1}
ar: لا يمكن تغيير الحالة من {0} إلى {1}
tr: Durum {0} durumundan {1} durumuna geçirilemez

# OrderMustBeReadyForCourierAssignment
source: Order must be in Ready status to assign a courier
ar: يجب أن يكون الطلب في حالة جاهز لتعيين سائق
tr: Kurye atamak için sipariş Hazır durumunda olmalıdır

# CourierAlreadyAssigned
source: A courier has already been assigned to this order
ar: تم تعيين سائق بالفعل لهذا الطلب
tr: Siparişe zaten bir kurye atanmış

# CourierAssignmentFailed
source: Failed to assign courier. Courier may not be available or order status may be invalid
ar: فشل في تعيين السائق. قد لا يكون السائق متاحًا أو قد تكون حالة الطلب غير صالحة
tr: Kurye atanamadı. Kurye müsait olmayabilir veya sipariş durumu geçersiz olabilir

# NoAvailableCouriers
source: No available couriers found nearby
ar: لم يتم العثور على سائقين متاحين بالقرب
tr: Yakınlarda müsait kurye bulunamadı

# VendorLocationNotSet
source: Vendor location is not set
ar: لم يتم تعيين موقع البائع
tr: Satıcı konumu ayarlanmamış

source: Order retrieved successfully
ar: تم استرجاع الطلب بنجاح
tr: Sipariş başarıyla getirildi

source: Order accepted successfully
ar: تم قبول الطلب بنجاح
tr: Sipariş başarıyla kabul edildi

source: Order rejected successfully
ar: تم رفض الطلب بنجاح
tr: Sipariş başarıyla reddedildi

source: Order status updated successfully
ar: تم تحديث حالة الطلب بنجاح
tr: Sipariş durumu başarıyla güncellendi

source: Courier assigned successfully
ar: تم تعيين السائق بنجاح
tr: Kurye başarıyla atandı

# CourierAutoAssignedSuccessfully
source: Courier automatically assigned successfully
ar: تم تعيين السائق تلقائيًا بنجاح
tr: Kurye otomatik olarak başarıyla atandı

source: Vendor orders retrieved successfully
ar: تم استرجاع طلبات البائع بنجاح
tr: Satıcı siparişleri başarıyla getirildi

source: Available couriers retrieved successfully
ar: تم استرجاع السائقين المتاحين بنجاح
tr: Müsait kuryeler başarıyla getirildi

# OrderAcceptedTitle
source: Order Accepted
ar: تم قبول الطلب
tr: Sipariş Onaylandı

# OrderAcceptedMessage
source: Order #{0} has been accepted and preparation has started.
ar: تم قبول طلبك #Order.{0} وبدأ التحضير.
tr: #Order.{0} numaralı siparişiniz onaylandı ve hazırlanmaya başlandı.

# OrderStatusChangedTitle
source: Order Status Updated
ar: تم تحديث حالة الطلب
tr: Sipariş Durumu Güncellendi

# OrderStatusPreparing
source: Your order is being prepared
ar: يتم تحضير طلبك
tr: Siparişiniz hazırlanıyor

# OrderStatusReady
source: Your order is ready, courier is being assigned
ar: طلبك جاهز، يتم تعيين سائق
tr: Siparişiniz hazır, kurye atanıyor

# OrderStatusDelivered
source: Your order has been delivered
ar: تم تسليم طلبك
tr: Siparişiniz teslim edildi

# OrderStatusCancelled
source: Your order has been cancelled
ar: تم إلغاء طلبك
tr: Siparişiniz iptal edildi

# OrderStatusUpdated
source: Order status has been updated
ar: تم تحديث حالة الطلب
tr: Sipariş durumu güncellendi

# OrderStatusMessage
source: Order #{0}: {1}
ar: طلب #Order.{0}: {1}
tr: #Order.{0} numaralı sipariş: {1}

# ErrorAcceptingOrder
source: An error occurred while accepting the order: {0}
ar: حدث خطأ أثناء قبول الطلب: {0}
tr: Sipariş kabul edilirken bir hata oluştu: {0}

# ErrorRejectingOrder
source: An error occurred while rejecting the order: {0}
ar: حدث خطأ أثناء رفض الطلب: {0}
tr: Sipariş reddedilirken bir hata oluştu: {0}

# ErrorUpdatingOrderStatus
source: An error occurred while updating order status: {0}
ar: حدث خطأ أثناء تحديث حالة الطلب: {0}
tr: Sipariş durumu güncellenirken bir hata oluştu: {0}
