Repository: osmanaliaydemir/talabi
Catalog: mobile/lib/l10n/app_*.arb
Languages: ar, tr

# profileLoadFailed
source: Failed to load profile: {error}
ar: فشل تحميل الملف الشخصي: {error}
tr: Profil yüklenemedi: {error}

# settingsUpdateFailed
source: Failed to update settings
ar: فشل تحديث الإعدادات
tr: Ayarlar güncellenemedi

source: Notifications
ar: الإشعارات
tr: Bildirimler

source: Push Notifications
ar: الإشعارات الفورية
tr: Anlık Bildirimler

source: Promotional Notifications
ar: إشعارات العروض
tr: Promosyon Bildirimleri

source: New Products
ar: منتجات جديدة
tr: Yeni Ürünler

source: More
ar: المزيد
tr: Daha Fazla

# accessibilityAndDisplay
source: Accessibility & Display
ar: إمكانية الوصول والعرض
tr: Erişilebilirlik ve Görünüm

source: Help Center
ar: مركز المساعدة
tr: Yardım Merkezi

source: How can we help you?
ar: كيف يمكننا مساعدتك؟
tr: Size nasıl yardımcı olabiliriz?

source: FAQ
ar: الأسئلة الشائعة
tr: SSS

source: Frequently asked questions
ar: الأسئلة المتكررة
tr: Sıkça sorulan sorular

source: Contact Support
ar: اتصل بالدعم
tr: Destek ile İletişim

source: Call Us
ar: اتصل بنا
tr: Bizi Arayın

source: Live Chat
ar: الدردشة المباشرة
tr: Canlı Sohbet

# available24x7
source: Available 24/7
ar: متاح على مدار الساعة
tr: 7/24 ulaşılabilir

source: Close
ar: إغلاق
tr: Kapat

# logoutConfirmTitle
source: Logout
ar: تسجيل الخروج
tr: Çıkış Yap

# logoutConfirmMessage
source: Are you sure you want to logout from your account?
ar: هل أنت متأكد أنك تريد تسجيل الخروج من حسابك؟
tr: Hesabınızdan çıkmak istediğinize emin misiniz?

source: Passwords do not match
ar: كلمات المرور غير متطابقة
tr: Şifreler eşleşmiyor

# passwordChangedSuccess
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح
tr: Şifre başarıyla değiştirildi

# changePasswordDescription
source: Enter your current password and choose a new one
ar: أدخل كلمة المرور الحالية واختر كلمة مرور جديدة
tr: Mevcut şifrenizi girin ve yeni şifrenizi seçin

source: Current Password
ar: كلمة المرور الحالية
tr: Mevcut Şifre

# currentPasswordRequired
source: Current password is required
ar: كلمة المرور الحالية مطلوبة
tr: Mevcut şifre gerekli

source: New Password
ar: كلمة المرور الجديدة
tr: Yeni Şifre

# newPasswordRequired
source: New password is required
ar: كلمة المرور الجديدة مطلوبة
tr: Yeni şifre gerekli

# confirmNewPassword
source: Confirm Password
ar: تأكيد كلمة المرور
tr: Şifre Tekrarı

# confirmPasswordRequired
source: Password confirmation is required
ar: تأكيد كلمة المرور مطلوب
tr: Şifre tekrarı gerekli

source: Secure your account
ar: قم بتأمين حسابك
tr: Hesabınızı güvende tutun

# addressesLoadFailed
source: Failed to load addresses
ar: فشل تحميل العناوين
tr: Adresler yüklenemedi

# deleteAddressTitle
source: Delete Address
ar: حذف العنوان
tr: Adresi Sil

# deleteAddressConfirm
source: Are you sure you want to delete this address?
ar: هل أنت متأكد أنك تريد حذف هذا العنوان؟
tr: Bu adresi silmek istediğinizden emin misiniz?

source: Delete
ar: حذف
tr: Sil

source: Address deleted
ar: تم حذف العنوان
tr: Adres silindi

source: Default address updated
ar: تم تحديث العنوان الافتراضي
tr: Varsayılan adres güncellendi

# manageDeliveryAddresses
source: Manage your delivery addresses
ar: إدارة عناوين التوصيل
tr: Teslimat adreslerinizi yönetin

source: No addresses yet
ar: لا توجد عناوين بعد
tr: Henüz adres eklenmemiş

# tapToAddAddress
source: Tap + button to add a new address
ar: اضغط على زر + لإضافة عنوان جديد
tr: Yeni adres eklemek için + butonuna tıklayın

# defaultLabel
source: Default
ar: افتراضي
tr: Varsayılan

source: Edit
ar: تعديل
tr: Düzenle

source: Set as Default
ar: تعيين كافتراضي
tr: Varsayılan Yap

# addressCountSingular
source: 1 address
ar: عنوان واحد
tr: 1 adres

# addressCountPlural
source: {count} addresses
ar: {count} عناوين
tr: {count} adres

# locationServicesDisabled
source: Location services are disabled
ar: خدمات الموقع معطلة
tr: Konum servisleri devre dışı

# pleaseSelectLocation
source: Please select a location
ar: الرجاء اختيار موقع
tr: Lütfen bir konum seçin

source: Selected Location
ar: الموقع المحدد
tr: Seçilen Konum

source: Address Title (Optional)
ar: عنوان العنوان (اختياري)
tr: Adres Başlığı (Opsiyonel)

source: Can be left empty
ar: يمكن تركه فارغًا
tr: Boş bırakılabilir

source: Address
ar: العنوان
tr: Adres

source: City
ar: المدينة
tr: Şehir

source: District
ar: الحي
tr: İlçe

# selectOrDragMarkerOnMap
source: Select a location on the map or drag the marker
ar: اختر موقعًا على الخريطة أو اسحب العلامة
tr: Haritada bir konum seçin veya işaretçiyi sürükleyin

# saveAddressButton
source: Save Address
ar: حفظ العنوان
tr: Adresi Kaydet

source: Select Address
ar: اختر العنوان
tr: Adres Seç

source: Select location from map
ar: اختر الموقع من الخريطة
tr: Haritadan konum seç

source: Address added
ar: تمت إضافة العنوان
tr: Adres eklendi

source: Address updated
ar: تم تحديث العنوان
tr: Adres güncellendi

source: Edit Address
ar: تعديل العنوان
tr: Adresi Düzenle

source: Add New Address
ar: إضافة عنوان جديد
tr: Yeni Adres Ekle

# updateAddressInfo
source: Update your address information
ar: قم بتحديث معلومات العنوان
tr: Adres bilgilerini güncelleyin

# enterDeliveryAddressDetails
source: Enter your delivery address details
ar: أدخل تفاصيل عنوان التوصيل
tr: Teslimat adresi bilgilerini girin

# addressTitleHint
source: Address Title (Home, Work, etc.)
ar: عنوان العنوان (المنزل، العمل، إلخ.)
tr: Adres Başlığı (Ev, İş, vb.)

# titleRequired
source: Title is required
ar: العنوان مطلوب
tr: Başlık gerekli

source: Select Address from Map
ar: اختر العنوان من الخريطة
tr: Haritadan Adres Seç

source: Full Address
ar: العنوان الكامل
tr: Açık Adres

# addressRequired
source: Address is required
ar: العنوان مطلوب
tr: Adres gerekli

# cityRequired
source: City is required
ar: المدينة مطلوبة
tr: Şehir gerekli

# districtRequired
source: District is required
ar: الحي مطلوب
tr: İlçe gerekli

source: Postal Code (Optional)
ar: الرمز البريدي (اختياري)
tr: Posta Kodu (Opsiyonel)

# updateAddressButton
source: Update Address
ar: تحديث العنوان
tr: Adresi Güncelle

source: Update address details
ar: تحديث تفاصيل العنوان
tr: Adres detaylarını güncelle

source: Create new address
ar: إنشاء عنوان جديد
tr: Yeni adres oluştur

source: Order Updates
ar: تحديثات الطلب
tr: Sipariş Güncellemeleri

# orderUpdatesDescription
source: Get notified when your order status changes
ar: احصل على إشعارات عند تغير حالة طلبك
tr: Sipariş durumu değişikliklerinde bildirim al

source: Promotions
ar: العروض
tr: Kampanyalar

# promotionsDescription
source: Special offers and promotions
ar: عروض خاصة وحملات ترويجية
tr: Özel teklifler ve kampanyalar

# newProductsDescription
source: Get notified when new products are added
ar: احصل على إشعارات عند إضافة منتجات جديدة
tr: Yeni ürün eklendiğinde bildirim al

source: Settings saved
ar: تم حفظ الإعدادات
tr: Ayarlar kaydedildi

# regionalSettingsDescription
source: Date and time settings
ar: إعدادات التاريخ والوقت
tr: Tarih ve saat ayarları

# timeZoneHint
source: e.g., Europe/Istanbul, America/New_York
ar: مثال: Europe/Istanbul, America/New_York
tr: Örn: Europe/Istanbul, America/New_York

# manageNotificationPreferences
source: Manage your notification preferences
ar: إدارة تفضيلات الإشعارات
tr: Bildirim tercihlerinizi yönetin

# orderHistoryDescription
source: View your past orders
ar: عرض طلباتك السابقة
tr: Geçmiş siparişlerinizi görüntüleyin

# myAddressesDescription
source: Manage your delivery addresses
ar: إدارة عناوين التوصيل الخاصة بك
tr: Teslimat adreslerinizi yönetin

source: My Favorite Products
ar: منتجاتي المفضلة
tr: Favori Ürünlerim

# myFavoriteProductsDescription
source: View and manage your favorite products
ar: عرض وإدارة منتجاتك المفضلة
tr: Beğendiğiniz ürünleri görüntüleyin ve yönetin

# changePasswordSubtitle
source: Change your password and enhance security
ar: تغيير كلمة المرور وتعزيز الأمان
tr: Şifrenizi değiştirin ve güvenliği artırın

# notificationSettingsDescription
source: Manage your notification preferences
ar: إدارة تفضيلات الإشعارات
tr: Bildirim tercihlerinizi yönetin

# selectLanguageDescription
source: Change application language
ar: تغيير لغة التطبيق
tr: Uygulama dilini değiştirin

# selectLanguageSubtitle
source: Choose your preferred language
ar: اختر لغتك المفضلة
tr: Tercih ettiğiniz dili seçin

source: Language changed
ar: تم تغيير اللغة
tr: Dil değiştirildi

# languagesCount
source: {count} languages
ar: {count} لغة
tr: {count} dil

# legalDocumentsDescription
source: Terms of use and policies
ar: شروط الاستخدام والسياسات
tr: Kullanım şartları ve politikalar

# helpCenterDescription
source: FAQ and support line
ar: الأسئلة الشائعة وخط الدعم
tr: SSS ve destek hattı

# logoutDescription
source: Sign out from your account
ar: تسجيل الخروج من حسابك
tr: Hesabınızdan çıkış yapın

# vendorRegister
source: Vendor Registration
ar: تسجيل البائع
tr: Satıcı Kaydı

source: Create Business Account
ar: إنشاء حساب تجاري
tr: İşletme Hesabı Oluştur

source: Create your store and start selling
ar: أنشئ متجرك وابدأ البيع
tr: Mağazanızı oluşturun ve satışa başlayın

source: Business Name
ar: اسم العمل
tr: İşletme Adı

# businessNameRequired
source: Business name is required
ar: اسم العمل مطلوب
tr: İşletme adı gerekli

# phoneNumberRequired
source: Phone number is required
ar: رقم الهاتف مطلوب
tr: Telefon numarası gerekli

source: Create Vendor Account
ar: إنشاء حساب البائع
tr: Satıcı Hesabı Oluştur

# alreadyHaveVendorAccount
source: Already have a vendor account?
ar: لديك حساب بائع بالفعل؟
tr: Zaten satıcı hesabınız var mı?

# isCustomerAccount
source: Customer account?
ar: حساب عميل؟
tr: Müşteri hesabı mı?

# emailAlreadyExists
source: An account with this email already exists.
ar: يوجد حساب بالفعل بهذا البريد الإلكتروني.
tr: Bu email adresi ile zaten bir hesap bulunmaktadır.

# enterFourDigitCode
source: Please enter the 4-digit code
ar: يرجى إدخال الرمز المكون من 4 أرقام
tr: Lütfen 4 haneli kodu giriniz

# emailVerifiedSuccess
source: Email address verified successfully
ar: تم التحقق من البريد الإلكتروني بنجاح
tr: Email adresi başarıyla doğrulandı

# emailVerifiedLoginFailed
source: Email verified but auto-login failed. Please login manually.
ar: تم التحقق من البريد الإلكتروني ولكن فشل تسجيل الدخول التلقائي. يرجى تسجيل الدخول يدوياً.
tr: Email doğrulandı ancak otomatik giriş başarısız. Lütfen giriş yapın.

source: Verification failed
ar: فشل التحقق
tr: Doğrulama başarısız

source: Verification code resent
ar: تم إعادة إرسال رمز التحقق
tr: Doğrulama kodu yeniden gönderildi

# codeSendFailed
source: Failed to send code
ar: فشل إرسال الرمز
tr: Kod gönderilemedi

# fourDigitVerificationCode
source: 4-Digit Verification Code
ar: رمز التحقق المكون من 4 أرقام
tr: 4 Haneli Doğrulama Kodu

# enterCodeSentToEmail
source: Enter the 4-digit code sent to {email}
ar: أدخل الرمز المكون من 4 أرقام المرسل إلى {email}
tr: {email} adresine gönderilen 4 haneli kodu giriniz

# codeExpiresIn
source: Code will expire in {time}
ar: ستنتهي صلاحية الرمز خلال {time}
tr: Kod {time} sonra geçersiz olacak

source: Resend Code
ar: إعادة إرسال الرمز
tr: Tekrar Kod Gönder

# settingsLoadError
source: Failed to load settings: {error}
ar: فشل تحميل الإعدادات: {error}
tr: Ayarlar yüklenemedi: {error}

source: Settings updated
ar: تم تحديث الإعدادات
tr: Ayarlar güncellendi

source: Review approved
ar: تمت الموافقة على المراجعة
tr: Yorum onaylandı

# reviewApproveError
source: Error approving review: {error}
ar: خطأ في الموافقة على المراجعة: {error}
tr: Yorum onaylanırken hata oluştu: {error}

source: Reject Review
ar: رفض المراجعة
tr: Yorumu Reddet

# rejectReviewConfirmation
source: Are you sure you want to reject this review? This cannot be undone.
ar: هل أنت متأكد أنك تريد رفض هذه المراجعة؟ لا يمكن التراجع عن هذا الإجراء.
tr: Bu yorumu reddetmek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Reject
ar: رفض
tr: Reddet

source: Review rejected
ar: تم رفض المراجعة
tr: Yorum reddedildi

# reviewRejectError
source: Error rejecting review: {error}
ar: خطأ في رفض المراجعة: {error}
tr: Yorum reddedilirken hata oluştu: {error}

source: Review Detail
ar: تفاصيل المراجعة
tr: Yorum Detayı

# userId
source: User ID: {id}
ar: معرف المستخدم: {id}
tr: Kullanıcı ID: {id}

source: Rating
ar: التقييم
tr: Puan

source: Comment
ar: تعليق
tr: Yorum

source: No comment
ar: لا يوجد تعليق
tr: Yorum yok

source: Date
ar: التاريخ
tr: Tarih

source: Approve
ar: موافقة
tr: Onayla

source: Verify
ar: تأكيد
tr: Onayla

source: Place Order
ar: إتمام الطلب
tr: Sipariş Ver

source: Delivery Address
ar: عنوان التوصيل
tr: Teslimat Adresi

# changeAddress
source: Change
ar: تغيير
tr: Değiştir

source: Payment Method
ar: طريقة الدفع
tr: Ödeme Yöntemi

source: Cash
ar: نقداً
tr: Nakit

source: Credit Card
ar: بطاقة ائتمان
tr: Kredi Kartı

source: Mobile Payment
ar: دفع عبر الجوال
tr: Mobil Ödeme

source: Coming Soon
ar: قريباً
tr: Çok Yakında

# orderNotePlaceholder
source: Add note for courier (optional)
ar: أضف ملاحظة للمندوب (اختياري)
tr: Kurye için not ekle (isteğe bağlı)

source: Estimated Delivery
ar: وقت التوصيل المتوقع
tr: Tahmini Teslimat

source: minutes
ar: دقيقة
tr: dakika

source: Order Summary
ar: ملخص الطلب
tr: Sipariş Özeti

# pleaseSelectAddress
source: Please select a delivery address
ar: يرجى اختيار عنوان التوصيل
tr: Lütfen teslimat adresi seçin

# pleaseSelectPaymentMethod
source: Please select a payment method
ar: يرجى اختيار طريقة الدفع
tr: Lütfen ödeme yöntemi seçin

# orderCreatedSuccess
source: Your order has been created successfully!
ar: تم إنشاء طلبك بنجاح!
tr: Siparişiniz başarıyla oluşturuldu!

source: No address found
ar: لم يتم العثور على عنوان
tr: Kayıtlı adres bulunamadı

# cashDescription
source: You can pay cash to the courier at the door.
ar: يمكنك الدفع نقداً للمندوب عند الباب.
tr: Nakit olarak kapıda kuryeye teslim edebilirsiniz.

# paymentComingSoonDescription
source: This payment method will be available soon.
ar: طريقة الدفع هذه ستكون متاحة قريباً.
tr: Bu ödeme yöntemi yakında hizmete girecektir.

source: Skip
ar: تخطي
tr: Geç

source: Next
ar: التالي
tr: İleri

source: Get Started
ar: ابدأ
tr: Hadi Başlayın!

# onboardingTitle1
source: Delicious Meals At Your Door In Minutes
ar: وجبات لذيذة عند بابك في دقائق
tr: Lezzetli Yemekler Dakikalar İçinde Kapınızda

# onboardingDesc1
source: Order your favorite meals from top restaurants and enjoy them warm.
ar: اطلب وجباتك المفضلة من أفضل المطاعم واستمتع بها ساخنة.
tr: Favori restoranlarınızdan dilediğiniz yemeği sipariş verin, sıcak sıcak tadını çıkarın.

# onboardingTitle2
source: Grocery Shopping At Your Door In Minutes
ar: تسوق البقالة عند بابك في دقائق
tr: Market Alışverişiniz Dakikalar İçinde Kapınızda

# onboardingDesc2
source: Fresh vegetables, fruits, and daily needs delivered fast.
ar: خضروات وفواكه طازجة واحتياجاتك اليومية تصلك بسرعة.
tr: Taze sebze, meyve ve günlük ihtiyaçlarınız en hızlı şekilde kapınızda.

# onboardingTitle3
source: Best Prices & Offers
ar: أفضل الأسعار والعروض
tr: En İyi Fiyatlar & Fırsatlar

# onboardingDesc3
source: Enjoy exclusive deals and competitive prices every day
ar: استمتع بصفقات حصرية وأسعار تنافسية كل يوم
tr: Her gün özel fırsatların ve rekabetçi fiyatların tadını çıkarın

source: Pending
ar: قيد الانتظار
tr: Bekleyen

source: Preparing
ar: قيد التجهيز
tr: Hazırlanıyor

source: Ready
ar: جاهز
tr: Hazır

source: Out for Delivery
ar: في الطريق للتسليم
tr: Teslimata Çıktı

source: Delivered
ar: تم التوصيل
tr: Teslim Edildi

# onWay
source: On the Way
ar: في الطريق
tr: Yolda

source: Cancelled
ar: ملغي
tr: İptal Edildi

source: Assigned
ar: مُعين
tr: Atandı

source: Accepted
ar: مقبول
tr: Kabul Edildi

source: Rejected
ar: مرفوض
tr: Reddedildi

source: Picked Up
ar: تم الاستلام
tr: Teslim Alındı

source: Courier Information
ar: معلومات السائق
tr: Kurye Bilgileri

source: Assigned At
ar: تاريخ التعيين
tr: Atanma Tarihi

source: Accepted At
ar: تاريخ القبول
tr: Kabul Tarihi

source: Picked Up At
ar: تاريخ الاستلام
tr: Teslim Alındı

source: Out for Delivery At
ar: تاريخ الخروج للتسليم
tr: Teslimata Çıktı

source: Vendor Orders
ar: طلبات البائع
tr: Satıcı Siparişleri

# pendingOrdersCount
source: {count} pending orders
ar: {count} طلب في الانتظار
tr: {count} adet bekleyen sipariş

# preparingOrdersCount
source: {count} preparing orders
ar: {count} طلب قيد التجهيز
tr: {count} adet hazırlanan sipariş

# readyOrdersCount
source: {count} ready orders
ar: {count} طلب جاهز
tr: {count} adet hazır sipariş

# deliveredOrdersCount
source: {count} orders delivered
ar: تم تسليم {count} طلب
tr: {count} adet sipariş teslim edildi

source: No orders found
ar: لم يتم العثور على طلبات
tr: Sipariş bulunamadı

source: Order
ar: طلب
tr: Sipariş

source: Customer
ar: العميل
tr: Müşteri

source: Vendor Dashboard
ar: لوحة تحكم البائع
tr: Satıcı Paneli

# summaryLoadError
source: Failed to load summary: {error}
ar: فشل تحميل الملخص: {error}
tr: Özet yüklenemedi: {error}

# welcomeVendor
source: Welcome, {name}
ar: مرحباً، {name}
tr: Hoş Geldiniz, {name}

# todayOrders
source: Today's Orders
ar: طلبات اليوم
tr: Bugünkü Siparişler

source: Pending Orders
ar: الطلبات المعلقة
tr: Bekleyen Siparişler

# todayRevenue
source: Today's Revenue
ar: إيرادات اليوم
tr: Bugünkü Gelir

source: Weekly Revenue
ar: إيرادات الأسبوع
tr: Haftalık Gelir

source: Quick Actions
ar: إجراءات سريعة
tr: Hızlı İşlemler

source: Reports
ar: التقارير
tr: Raporlar

source: Logo updated
ar: تم تحديث الشعار
tr: Logo güncellendi

# logoUploadFailed
source: Logo upload failed: {error}
ar: فشل تحميل الشعار: {error}
tr: Logo yüklenemedi: {error}

source: Location Selected (Change)
ar: تم تحديد الموقع (تغيير)
tr: Konum Seçildi (Değiştir)

# selectLocationFromMapRequired
source: Select Location from Map *
ar: اختر الموقع من الخريطة *
tr: Haritadan Konum Seç *

# locationSelectionRequired
source: Location selection from map is required
ar: اختيار الموقع من الخريطة مطلوب
tr: Haritadan konum seçimi zorunludur

# addressAutoFillHint
source: Address selected from map is auto-filled, you can edit manually
ar: يتم ملء العنوان المحدد من الخريطة تلقائيًا، يمكنك تعديله يدويًا
tr: Haritadan seçilen adres otomatik doldurulur, manuel düzenleyebilirsiniz

# selectLocationFirst
source: You must select a location from map first
ar: يجب عليك اختيار موقع من الخريطة أولاً
tr: Önce haritadan konum seçmelisiniz

# vendorNotificationsTitle
source: Notifications
ar: الإشعارات
tr: Bildirimler

# vendorNotificationsEmptyMessage
source: You have no notifications yet.
ar: ليس لديك إشعارات بعد.
tr: Henüz bildiriminiz yok.

# vendorNotificationsErrorMessage
source: An error occurred while loading notifications.
ar: حدث خطأ أثناء تحميل الإشعارات.
tr: Bildirimler yüklenirken bir hata oluştu.

source: Vendor Login
ar: تسجيل دخول البائع
tr: Satıcı Girişi

source: Welcome Back, Vendor!
ar: مرحباً بعودتك، أيها البائع!
tr: Tekrar Hoş Geldiniz, Satıcı!

# vendorLoginDescription
source: Sign in to manage your store and orders
ar: سجل الدخول لإدارة متجرك وطلباتك
tr: Mağazanızı ve siparişlerinizi yönetmek için giriş yapın

# areYouCustomer
source: Are you a customer?
ar: هل أنت عميل؟
tr: Müşteri misiniz?

# vendorProductsTitle
source: My Products
ar: منتجاتي
tr: Ürünlerim

# vendorProductsSearchHint
source: Search products...
ar: ابحث عن المنتجات...
tr: Ürün ara...

# vendorProductsLoadError
source: Failed to load products: {error}
ar: فشل تحميل المنتجات: {error}
tr: Ürünler yüklenemedi: {error}

# vendorProductsSetOutOfStock
source: {productName} set to out of stock
ar: تم تعيين {productName} كغير متوفر
tr: {productName} stok dışı yapıldı

# vendorProductsSetInStock
source: {productName} is in stock
ar: {productName} متوفر الآن
tr: {productName} stokta

# vendorProductsDeleteTitle
source: Delete Product
ar: حذف المنتج
tr: Ürünü Sil

# vendorProductsDeleteConfirmation
source: Are you sure you want to delete {productName}?
ar: هل أنت متأكد أنك تريد حذف {productName}؟
tr: {productName} ürününü silmek istediğinize emin misiniz?

# vendorProductsDeleteSuccess
source: {productName} has been deleted
ar: تم حذف {productName}
tr: {productName} silindi

# vendorProductsEmpty
source: No products found
ar: لم يتم العثور على منتجات
tr: Ürün bulunamadı

# vendorProductsAddFirst
source: Add Your First Product
ar: أضف منتجك الأول
tr: İlk Ürününü Ekle

# vendorProductsAddNew
source: New Product
ar: منتج جديد
tr: Yeni Ürün

# vendorProductFormEditTitle
source: Edit Product
ar: تعديل المنتج
tr: Ürün Düzenle

# vendorProductFormNewTitle
source: New Product
ar: منتج جديد
tr: Yeni Ürün

# vendorProductFormImageUploaded
source: Image uploaded
ar: تم تحميل الصورة
tr: Resim yüklendi

# vendorProductFormImageUploadError
source: Failed to upload image: {error}
ar: فشل تحميل الصورة: {error}
tr: Resim yüklenemedi: {error}

# vendorProductFormSourceCamera
source: Camera
ar: الكاميرا
tr: Kamera

# vendorProductFormSourceGallery
source: Gallery
ar: المعرض
tr: Galeri

# vendorProductFormCreateSuccess
source: Product created
ar: تم إنشاء المنتج
tr: Ürün oluşturuldu

# vendorProductFormUpdateSuccess
source: Product updated
ar: تم تحديث المنتج
tr: Ürün güncellendi

# vendorProductFormError
source: Error: {error}
ar: خطأ: {error}
tr: Hata: {error}

# vendorProductFormNameLabel
source: Product Name *
ar: اسم المنتج *
tr: Ürün Adı *

# vendorProductFormNameRequired
source: Product name is required
ar: اسم المنتج مطلوب
tr: Ürün adı gerekli

# vendorProductFormDescriptionLabel
source: Description
ar: الوصف
tr: Açıklama

# vendorProductFormCategoryLabel
source: Category
ar: الفئة
tr: Kategori

# vendorProductFormPriceLabel
source: Price *
ar: السعر *
tr: Fiyat *

# vendorProductFormPriceRequired
source: Price is required
ar: السعر مطلوب
tr: Fiyat gerekli

# vendorProductFormPriceInvalid
source: Please enter a valid price
ar: الرجاء إدخال سعر صالح
tr: Geçerli bir fiyat girin

# vendorProductFormStockLabel
source: Stock Quantity
ar: كمية المخزون
tr: Stok Miktarı

# vendorProductFormInvalidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صالح
tr: Geçerli bir sayı girin

# vendorProductFormPreparationTimeLabel
source: Preparation Time (minutes)
ar: وقت التحضير (دقائق)
tr: Hazırlık Süresi (dakika)

# vendorProductFormInStockLabel
source: In Stock
ar: متوفر
tr: Stokta

# vendorProductFormInStockDescription
source: The product will be visible to customers
ar: سيظهر المنتج للعملاء
tr: Ürün müşterilere gösterilecek

# vendorProductFormOutOfStockDescription
source: The product will be marked as out of stock
ar: سيتم وضع علامة على المنتج كغير متوفر
tr: Ürün stok dışı olarak işaretlenecek

# updateButton
source: Update
ar: تحديث
tr: Güncelle

# createButton
source: Create
ar: إنشاء
tr: Oluştur

# vendorProductFormAddImage
source: Add Image
ar: إضافة صورة
tr: Resim Ekle

# vendorProfileTitle
source: My Vendor Profile
ar: ملفي الشخصي كبائع
tr: Satıcı Profilim

# vendorFallbackSubtitle
source: Vendor
ar: بائع
tr: Satıcı

# businessInfo
source: Business Information
ar: معلومات العمل
tr: İşletme Bilgileri

# addressLabel
source: Address
ar: العنوان
tr: Adres

# phoneLabel
source: Phone
ar: الهاتف
tr: Telefon

source: General Settings
ar: الإعدادات العامة
tr: Genel Ayarlar

# businessSettingsTitle
source: Business Settings
ar: إعدادات العمل
tr: İşletme Ayarları

# businessSettingsSubtitle
source: Minimum order, delivery fee, and other settings
ar: الحد الأدنى للطلب، رسوم التوصيل، وإعدادات أخرى
tr: Minimum sipariş, teslimat ücreti ve diğer ayarlar

# languageNameTr
source: Turkish
ar: التركية
tr: Türkçe

# languageNameAr
source: Arabic
ar: العربية
tr: العربية

# businessNameFallback
source: Business Name
ar: اسم العمل
tr: İşletme Adı

source: Retry
ar: إعادة المحاولة
tr: Yeniden Dene

source: Mark as Read
ar: وضع علامة كمقروء
tr: Okundu olarak işaretle

source: Pending Reviews
ar: المراجعات المعلقة
tr: Bekleyen Yorumlar

source: No pending reviews
ar: لا توجد مراجعات معلقة
tr: Bekleyen yorum yok

# reviewsLoadError
source: Failed to load reviews: {error}
ar: فشل تحميل المراجعات: {error}
tr: Yorumlar yüklenemedi: {error}

source: Sales Reports
ar: تقارير المبيعات
tr: Satış Raporları
