Repository: osmanaliaydemir/talabi
Catalog: mobile/lib/l10n/app_*.arb
Languages: ar, tr

# upsellMessage
source: Add {amount} more to get the discount!
tr: {amount} daha ekle, indirimi kap!

source: Campaign Applied
tr: Kampanya Uygulandı

source: Free
ar: مجاني
tr: Ücretsiz

source: Welcome
ar: مرحباً
tr: Hoş Geldiniz

source: Login
ar: تسجيل الدخول
tr: Giriş Yap

source: Register
ar: التسجيل
tr: Kayıt Ol

source: Logout
ar: تسجيل الخروج
tr: Çıkış Yap

source: Profile
ar: الملف الشخصي
tr: Profil

source: Settings
ar: الإعدادات
tr: Ayarlar

source: Language
ar: اللغة
tr: Dil

source: Currency
ar: العملة
tr: Para Birimi

source: Turkish
ar: التركية
tr: Türkçe

source: English
ar: الإنجليزية
tr: İngilizce

source: Arabic
ar: العربية
tr: Arapça

source: Turkish Lira
ar: الليرة التركية
tr: Türk Lirası

source: Save
ar: حفظ
tr: Kaydet

# productResmi
source: Product image
ar: صورة المنتج
tr: Ürün resmi

# yildiz
source: Stars
ar: نجمة
tr: yıldız

# favorilereEkle
source: Add to favorites
ar: إضافة إلى المفضلة
tr: Favorilere ekle

# favorilerdenCikar
source: Remove from favorites
ar: إزالة من المفضلة
tr: Favorilerden çıkar

source: Menu
ar: قائمة
tr: Menü

# fiyat
source: Price
ar: السعر
tr: Fiyat

# adediAzalt
source: Decrease quantity
ar: تقليل الكمية
tr: Adedi azalt

# miktar
source: Quantity
ar: الكمية
tr: Miktar

# adediArtir
source: Increase quantity
ar: زيادة الكمية
tr: Adedi artır

# sepeteEkle
source: Add to cart
ar: أضف إلى السلة
tr: Sepete ekle

source: Share
ar: مشاركة
tr: Paylaş

# back
source: Go back
ar: رجوع
tr: Geri dön

# degerlendirme
source: review
ar: تقييم
tr: değerlendirme

source: Total amount
ar: المبلغ الإجمالي
tr: Toplam tutar

# degerlendirmeSayisi
source: {count} reviews
ar: {count} تقييمات
tr: {count} değerlendirme

source: Your Order Feedback
tr: Sipariş Değerlendirmen

# orderNumberWithId
source: Order number {id}
tr: {id} numaralı sipariş

source: Pending Approval
tr: Onay Bekliyor

source: Approved
tr: Onaylandı

# errorOccurred
source: An error occurred
tr: Bir hata oluştu

# logoutConfirmation
source: Are you sure you want to log out?
tr: Oturumu kapatmak istediğinize emin misiniz?

source: Be the first to review
tr: İlk yorumu sen yap

source: Write a review
tr: Yorum yap

# mustOrderToReview
source: You must have ordered this product to leave a review.
tr: Yorum yapabilmek için üründen sipariş etmiş olmanız gerekmektedir.

source: Review created successfully
tr: Değerlendirme başarıyla oluşturuldu

source: Send
tr: Gönder

# characterLimitInfo
source: Character limit: {min}-{max} (Current: {current})
tr: Karakter sınırı: {min}-{max} (Şu an: {current})

source: My Reviews
tr: Değerlendirmelerim

# myReviewsDescription
source: See all reviews you have made
tr: Yaptığınız tüm yorumları görün

# commentTooShort
source: Comment too short (min {min} characters)
tr: Yorum çok kısa (en az {min} karakter)

source: Cancel
ar: إلغاء
tr: İptal

source: Products
ar: المنتجات
tr: Ürünler

source: Vendors
ar: البائعون
tr: Satıcılar

source: Cart
ar: السلة
tr: Sepet

source: Orders
ar: الطلبات
tr: Siparişler

# notificationAll
source: All
tr: Tümü

# notificationOrders
source: Orders
tr: Siparişler

# notificationReviews
source: Reviews
tr: Yorumlar

# notificationSystem
source: System
tr: Sistem

source: Favorites
ar: المفضلة
tr: Favoriler

source: Addresses
ar: العناوين
tr: Adresler

source: Search
ar: بحث
tr: Ara

source: Price
ar: السعر
tr: Fiyat

source: Add to Cart
ar: أضف إلى السلة
tr: Sepete Ekle

source: Total
ar: المجموع
tr: Toplam

source: Total Price
ar: السعر الإجمالي
tr: Toplam Fiyat

source: Checkout
ar: الدفع
tr: Ödeme

# checkoutSubtitle
source: Secure Payment
ar: دفع آمن
tr: Güvenli Ödeme

source: Order Information
ar: معلومات الطلب
tr: Sipariş Bilgileri

source: Order History
ar: سجل الطلبات
tr: Sipariş Geçmişi

source: Order Detail
ar: تفاصيل الطلب
tr: Sipariş Detayı

source: Delivery Tracking
ar: تتبع التسليم
tr: Teslimat Takibi

source: Select Language
ar: اختر اللغة
tr: Dil Seç

source: Select Currency
ar: اختر العملة
tr: Para Birimi Seç

# selectCurrencyDescription
source: Currency selection
ar: اختيار العملة
tr: Para birimi seçimi

source: Regional Settings
ar: الإعدادات الإقليمية
tr: Bölgesel Ayarlar

source: Date Format
ar: تنسيق التاريخ
tr: Tarih Formatı

source: Time Format
ar: تنسيق الوقت
tr: Saat Formatı

source: Time Zone
ar: المنطقة الزمنية
tr: Saat Dilimi

# hour24
source: 24 Hour
ar: 24 ساعة
tr: 24 Saat

# hour12
source: 12 Hour
ar: 12 ساعة
tr: 12 Saat

source: Discover
ar: استكشف
tr: Keşfet

source: My Favorites
ar: مفضلاتي
tr: Favorilerim

source: My Cart
ar: سلتي
tr: Sepetim

source: My Orders
ar: طلباتي
tr: Siparişlerim

source: My Account
ar: حسابي
tr: Hesabım

source: My Profile
ar: ملفي الشخصي
tr: Profilim

source: User
ar: المستخدم
tr: Kullanıcı

source: Edit Profile
ar: تعديل الملف الشخصي
tr: Profili Düzenle

# editProfileDescription
source: Edit business name, address and contact information
ar: تعديل اسم العمل والعنوان ومعلومات الاتصال
tr: İşletme adı, adres ve iletişim bilgilerini düzenle

# editCourierProfileDescription
source: Edit name, phone, vehicle information and working hours
ar: تعديل الاسم والهاتف ومعلومات المركبة وساعات العمل
tr: Ad, telefon, araç bilgisi ve çalışma saatlerini düzenle

source: Change Password
ar: تغيير كلمة المرور
tr: Şifre Değiştir

source: Notification Settings
ar: إعدادات الإشعارات
tr: Bildirim Ayarları

source: My Addresses
ar: عناويني
tr: Adreslerim

source: Favorite Products
ar: المنتجات المفضلة
tr: Favori Ürünler

source: Popular Products
ar: المنتجات الشائعة
tr: Popüler Ürünler

# popularVendors
source: Popular Businesses
ar: الشركات الشائعة
tr: Popüler İşletmeler

source: View All
ar: عرض الكل
tr: Tümünü Gör

source: Product Detail
ar: تفاصيل المنتج
tr: Ürün Detayı

source: Description
ar: الوصف
tr: Açıklama

source: Vendor
ar: البائع
tr: Satıcı

source: Category
ar: الفئة
tr: Kategori

source: Add to Favorites
ar: إضافة إلى المفضلة
tr: Favorilere Ekle

source: Remove from Favorites
ar: إزالة من المفضلة
tr: Favorilerden Çıkar

source: In Stock
ar: متوفر
tr: Stokta Var

source: Out of Stock
ar: غير متوفر
tr: Stokta Yok

source: Sign In
ar: تسجيل الدخول
tr: Giriş Yap

source: Sign Up
ar: إنشاء حساب
tr: Kayıt Ol

# welcomeBack
source: Welcome!
ar: مرحباً بك!
tr: Hoş Geldiniz!

# loginDescription
source: Sign in to place orders and track them in real-time
ar: سجل الدخول لتقديم الطلبات وتتبعها في الوقت الفعلي
tr: Sipariş vermek ve verdiğiniz siparişleri anlık olarak takip etmek için giriş yapın

source: Email Address
ar: عنوان البريد الإلكتروني
tr: E-posta Adresi

source: Password
ar: كلمة المرور
tr: Şifre

source: Remember me?
ar: تذكرني؟
tr: Beni hatırla?

source: Recovery Password
ar: استعادة كلمة المرور
tr: Şifremi Unuttum

source: Log in
ar: تسجيل الدخول
tr: Giriş Yap

source: Or continue with
ar: أو المتابعة مع
tr: Veya devam et

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
tr: Hesabınız yok mu?

source: Create Account
ar: إنشاء حساب
tr: Hesap Oluştur

# registerDescription
source: Sign up to get started with Talabi
ar: سجل للبدء مع Talabi
tr: Talabi'ye başlamak için kayıt olun

source: Full Name
ar: الاسم الكامل
tr: Ad Soyad

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟
tr: Zaten hesabınız var mı?

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب
tr: E-posta gerekli

# validEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح
tr: Geçerli bir e-posta girin

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة
tr: Şifre gerekli

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل
tr: Şifre en az 6 karakter olmalı

# fullNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب
tr: Ad soyad gerekli

source: Login failed
ar: فشل تسجيل الدخول
tr: Giriş başarısız

# registerFailed
source: Registration failed
ar: فشل التسجيل
tr: Kayıt başarısız

source: Password Reset
ar: إعادة تعيين كلمة المرور
tr: Şifre Sıfırlama

source: Forget Password
ar: نسيت كلمة المرور
tr: Şifremi Unuttum

# forgetPasswordDescription
source: Enter your email account to reset password
ar: أدخل عنوان بريدك الإلكتروني لإعادة تعيين كلمة المرور
tr: Şifrenizi sıfırlamak için e-posta adresinizi girin

# continueButton
source: Continue
ar: متابعة
tr: Devam Et

# passwordResetEmailSent
source: Password reset email has been sent to your email address
ar: تم إرسال بريد إعادة تعيين كلمة المرور إلى عنوان بريدك الإلكتروني
tr: Şifre sıfırlama e-postası e-posta adresinize gönderildi

# passwordResetFailed
source: Failed to send password reset email
ar: فشل إرسال بريد إعادة تعيين كلمة المرور
tr: Şifre sıfırlama e-postası gönderilemedi

source: Email Verification
ar: التحقق من البريد الإلكتروني
tr: E-posta Doğrulama

source: Check Your Email
ar: تحقق من بريدك الإلكتروني
tr: E-postanızı Kontrol Edin

# emailVerificationDescription
source: We have sent a verification link to your email address. Please check your inbox and click the link to verify your account.
ar: لقد أرسلنا رابط التحقق إلى عنوان بريدك الإلكتروني. يرجى التحقق من صندوق الوارد الخاص بك والنقر على الرابط للتحقق من حسابك.
tr: E-posta adresinize bir doğrulama bağlantısı gönderdik. Lütfen gelen kutunuzu kontrol edin ve hesabınızı doğrulamak için bağlantıya tıklayın.

source: I Have Verified
ar: لقد قمت بالتحقق
tr: Doğruladım

source: Resend Email
ar: إعادة إرسال البريد الإلكتروني
tr: E-postayı Tekrar Gönder

source: Resend feature coming soon
ar: ميزة إعادة الإرسال قريباً
tr: Tekrar gönderme özelliği yakında gelecek

# verificationEmailResent
source: Verification email has been resent
ar: تم إعادة إرسال بريد التحقق الإلكتروني
tr: Doğrulama e-postası tekrar gönderildi

# pleaseVerifyEmail
source: Please verify your email address.
ar: يرجى التحقق من عنوان بريدك الإلكتروني.
tr: Lütfen e-posta adresinizi doğrulayın.

source: Offline Mode
ar: وضع عدم الاتصال
tr: Çevrimdışı Mod

# offlineModeDescription
source: Some features may be limited
ar: قد تكون بعض الميزات محدودة
tr: Bazı özellikler sınırlı olabilir

# accessibilityTitle
source: Accessibility & Display
ar: إمكانية الوصول والعرض
tr: Erişilebilirlik ve Görünüm

# accessibilityDescription
source: Customize themes, contrast and text size for better readability
ar: خصص السمات والتباين وحجم النص لتحسين سهولة القراءة
tr: Daha rahat okunabilirlik için tema, kontrast ve yazı boyutunu özelleştir

# displaySettings
source: Display
ar: العرض
tr: Görünüm

source: Dark Mode
ar: الوضع الداكن
tr: Karanlık Mod

# darkModeDescription
source: Use dark theme for low light environments
ar: استخدم النمط الداكن للبيئات منخفضة الإضاءة
tr: Düşük ışık ortamları için koyu temayı kullan

source: High Contrast
ar: تباين عالٍ
tr: Yüksek Kontrast

# highContrastDescription
source: Increase contrast for better visibility
ar: زيادة التباين لتحسين الوضوح
tr: Daha iyi görünürlük için kontrastı artır

source: Text Size
ar: حجم النص
tr: Metin Boyutu

# textSizeDescription
source: Adjust text size for better readability
ar: اضبط حجم النص لسهولة قراءة أفضل
tr: Okunabilirliği artırmak için yazı boyutunu ayarla

# textSizePreview
source: Preview Text
ar: نص معاينة
tr: Önizleme Metni

# cartEmptyMessage
source: Your cart is empty
ar: سلتك فارغة
tr: Sepetiniz boş

# cartEmptySubMessage
source: There are no products in your cart. Start shopping now!
tr: Sepetinde ürün bulunmamaktadır. Hemen alışverişe başla!

source: Start Shopping
tr: Alışverişe Başla

source: Recommended For You
ar: مقترح لك
tr: Senin İçin Önerilenler

# cartVoucherPlaceholder
source: Enter your voucher code
ar: أدخل رمز القسيمة
tr: Kupon kodunuzu girin

# cartSubtotalLabel
source: Subtotal
ar: المجموع الفرعي
tr: Ara Toplam

# discountTitle
source: Discount
ar: خصم
tr: İndirim

# cartDeliveryFeeLabel
source: Delivery Fee
ar: رسوم التوصيل
tr: Teslimat Ücreti

source: Free delivery reached!
ar: تم الوصول إلى التوصيل المجاني!
tr: Ücretsiz teslimat sınırına ulaştınız!

# remainingForFreeDelivery
source: {amount} more for free delivery
ar: {amount} متبقي للتوصيل المجاني
tr: Ücretsiz teslimat için {amount} daha

# freeDeliveryDescription
source: Add more items to your cart to get free delivery!
ar: أضف المزيد من العناصر إلى سلتك للحصول على توصيل مجاني!
tr: Sepetinize biraz daha ürün ekleyerek kargo ücretinden kurtulun!

# cartTotalAmountLabel
source: Total Amount
ar: المبلغ الإجمالي
tr: Genel Toplam

# checkoutTitle
source: Checkout
ar: الدفع
tr: Ödeme

source: Add Order Note
ar: إضافة ملاحظة الطلب
tr: Sipariş Notu Ekle

source: Order Note
ar: ملاحظة الطلب
tr: Sipariş Notu

# enterOrderNoteHint
source: Enter your note for the order...
ar: أدخل ملاحظتك للطلب...
tr: Siparişiniz için notunuzu girin...

source: Coupon Applied
ar: تم تطبيق القسيمة
tr: Kupon Uygulandı

source: Coupon Removed
ar: تم إزالة القسيمة
tr: Kupon Kaldırıldı

source: Enter Coupon Code
ar: أدخل رمز القسيمة
tr: Kupon Kodu Girin

source: Apply
ar: تطبيق
tr: Uygula

# noCampaignsFound
source: No Active Campaigns
ar: لا توجد حملات نشطة
tr: Aktif Kampanya Yok

# noCampaignsDescription
source: There are no active campaigns at the moment. Please check back later or enter a coupon code.
ar: لا توجد حملات نشطة في الوقت الحالي. يرجى التحقق مرة أخرى لاحقًا أو إدخال رمز قسيمة.
tr: Şu anda aktif bir kampanya bulunmamaktadır. Lütfen daha sonra tekrar kontrol edin veya kupon kodu girin.

source: Confirm Order
ar: تأكيد الطلب
tr: Siparişi Onayla

# cartSameVendorWarning
source: All items in the cart must be from the same vendor
ar: يجب أن تكون جميع المنتجات في السلة من نفس المتجر
tr: Sepetteki tüm ürünler aynı marketten olmalı

# orderPlacedTitle
source: Order Received!
ar: تم استلام الطلب!
tr: Sipariş Alındı!

# orderPlacedMessage
source: Your order number: {orderId} Total: {total}
ar: رقم طلبك: {orderId} الإجمالي: {total}
tr: Sipariş numaranız: {orderId} Toplam: {total}

source: OK
ar: حسنًا
tr: Tamam

# duplicateEmail
source: An account with this email address already exists.
ar: يوجد بالفعل حساب بهذا البريد الإلكتروني
tr: Bu email adresi ile zaten bir hesap bulunmaktadır.

# passwordRuleChars
source: At least 6 characters
ar: 6 أحرف على الأقل
tr: En az 6 karakter

# passwordRuleDigit
source: At least one digit (0-9)
ar: رقم واحد على الأقل (0-9)
tr: En az bir rakam (0-9)

# passwordRuleUpper
source: At least one uppercase letter (A-Z)
ar: حرف كبير واحد على الأقل (A-Z)
tr: En az bir büyük harf (A-Z)

# passwordRuleLower
source: At least one lowercase letter (a-z)
ar: حرف صغير واحد على الأقل (a-z)
tr: En az bir küçük harf (a-z)

# passwordRuleSpecial
source: At least one special character (!@#$%^&* etc.)
ar: رمز خاص واحد على الأقل (!@#$%^&* إلخ.)
tr: En az bir özel karakter (@,*,!,? vb.)

# googleLoginFailed
source: Google login failed: {error}
ar: فشل تسجيل الدخول عبر Google: {error}
tr: Google ile giriş başarısız: {error}

# appleLoginFailed
source: Apple login failed: {error}
ar: فشل تسجيل الدخول عبر Apple: {error}
tr: Apple ile giriş başarısız: {error}

# facebookLoginFailed
source: Facebook login failed: {error}
ar: فشل تسجيل الدخول عبر Facebook: {error}
tr: Facebook ile giriş başarısız: {error}

# errorWithMessage
source: Error: {error}
ar: خطأ: {error}
tr: Hata: {error}

# clearCartTitle
source: Clear Cart
ar: تفريغ السلة
tr: Sepeti Temizle

# clearCartMessage
source: Do you want to remove all items from the cart?
ar: هل تريد إزالة جميع المنتجات من السلة؟
tr: Sepetteki tüm ürünleri kaldırmak istiyor musunuz?

# clearCartNo
source: No
ar: لا
tr: Hayır

# clearCartYes
source: Yes
ar: نعم
tr: Evet

# clearCartSuccess
source: Cart cleared successfully
ar: تم تفريغ السلة بنجاح
tr: Sepet başarıyla temizlendi

# categoryChangeConfirmTitle
source: Category Change
ar: تغيير الفئة
tr: Kategori Değişimi

# categoryChangeConfirmMessage
source: Changing category will clear your cart items.
ar: سيؤدي تغيير الفئة إلى مسح المنتجات الموجودة في سلتك.
tr: Kategori değişimi yaptığınızda sepetinizdeki ürünler silinecektir.

# categoryChangeConfirmOk
source: Confirm
ar: تأكيد
tr: Onayla

# categoryChangeConfirmCancel
source: Cancel
ar: إلغاء
tr: İptal Et

# productByVendor
source: By {vendorName}
ar: بواسطة {vendorName}
tr: Satıcı: {vendorName}

# alreadyReviewedTitle
source: Information
ar: معلومات
tr: Bilgi

# alreadyReviewedMessage
source: You have already reviewed this product.
ar: لقد قمت بتقييم هذا المنتج من قبل.
tr: Bu ürüne daha önce puan verdiniz.

# writeReview
source: Write a Review
ar: اكتب مراجعة
tr: Yorum Yaz

source: Courier Login
ar: تسجيل دخول السائق
tr: Kurye Girişi

# courierWelcome
source: Welcome Back, Courier!
ar: مرحباً بعودتك أيها السائق!
tr: Hoş Geldin Kurye!

# courierSubtitle
source: Sign in to manage your deliveries
ar: سجل الدخول لإدارة عمليات التسليم الخاصة بك
tr: Teslimatlarını yönetmek için giriş yap

# areYouCourier
source: Are you a courier?
ar: هل أنت سائق؟
tr: Kurye misiniz?

# areYouVendor
source: Are you a vendor?
ar: هل أنت بائع؟
tr: Satıcı mısınız?

# courierSignIn
source: Sign in
ar: تسجيل دخول السائق
tr: Giriş yap

# courierLoginLink
source: Courier Login
ar: تسجيل دخول السائق
tr: Kurye Girişi

# roleCustomer
source: Customer
ar: عميل
tr: Müşteri

# roleVendor
source: Vendor
ar: بائع
tr: Satıcı

# roleCourier
source: Courier
ar: سائق
tr: Kurye

# roleAdmin
source: Admin
ar: مسؤول
tr: Yönetici

source: Active Deliveries
ar: عمليات التسليم النشطة
tr: Aktif Teslimatlar

source: Delivery History
ar: سجل التسليم
tr: Teslimat Geçmişi

source: Earnings
ar: الأرباح
tr: Kazançlar

source: Deliveries
ar: التسليمات
tr: Teslimatlar

source: No active deliveries
ar: لا توجد عمليات تسليم نشطة
tr: Aktif teslimat yok

source: Courier profile not found
ar: لم يتم العثور على ملف السائق الشخصي
tr: Kurye profili bulunamadı

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح
tr: Profil başarıyla güncellendi

# invalidStatus
source: Invalid status. Valid values: Offline, Available, Busy, Break, Assigned
ar: حالة غير صالحة. القيم الصالحة: Offline, Available, Busy, Break, Assigned
tr: Geçersiz durum. Geçerli değerler: Offline, Available, Busy, Break, Assigned

source: Cannot go available outside working hours
ar: لا يمكن أن تكون متاحاً خارج ساعات العمل
tr: Çalışma saatleri dışında müsait olamazsınız

source: Cannot go offline with active orders
ar: لا يمكن أن تكون غير متصل مع وجود طلبات نشطة
tr: Aktif siparişleriniz varken çevrimdışı olamazsınız

source: Status updated
ar: تم تحديث الحالة
tr: Durum güncellendi

source: Location updated successfully
ar: تم تحديث الموقع بنجاح
tr: Konum başarıyla güncellendi

source: Invalid latitude
ar: خط عرض غير صالح
tr: Geçersiz enlem

source: Invalid longitude
ar: خط طول غير صالح
tr: Geçersiz boylam

source: Order accepted successfully
ar: تم قبول الطلب بنجاح
tr: Sipariş başarıyla kabul edildi

source: Order rejected successfully
ar: تم رفض الطلب بنجاح
tr: Sipariş başarıyla reddedildi

source: Order picked up successfully
ar: تم استلام الطلب بنجاح
tr: Sipariş başarıyla alındı

source: Order delivered successfully
ar: تم تسليم الطلب بنجاح
tr: Sipariş başarıyla teslim edildi

source: Delivery proof submitted successfully
ar: تم إرسال إثبات التسليم بنجاح
tr: Teslimat kanıtı başarıyla gönderildi

# orderNotFoundOrNotAssigned
source: Order not found or not assigned to you
ar: الطلب غير موجود أو لم يتم تعيينه لك
tr: Sipariş bulunamadı veya size atanmamış

source: Order must be delivered before submitting proof
ar: يجب تسليم الطلب قبل إرسال إثبات التسليم
tr: Teslimat kanıtı göndermeden önce sipariş teslim edilmiş olmalı

# failedToAcceptOrder
source: Failed to accept order. It might be already taken or cancelled
ar: فشل قبول الطلب. قد يكون قد تم أخذه بالفعل أو تم إلغاؤه
tr: Sipariş kabul edilemedi. Zaten alınmış veya iptal edilmiş olabilir

source: Failed to reject order
ar: فشل رفض الطلب
tr: Sipariş reddedilemedi

source: Failed to pick up order
ar: فشل استلام الطلب
tr: Sipariş alınamadı

source: Failed to deliver order
ar: فشل تسليم الطلب
tr: Sipariş teslim edilemedi

# failedToLoadProfile
source: Failed to load courier profile: {error}
ar: فشل تحميل الملف الشخصي: {error}
tr: Profil yüklenemedi: {error}

source: Failed to update status
ar: فشل تحديث الحالة
tr: Durum güncellenemedi

source: Failed to update location
ar: فشل تحديث الموقع
tr: Konum güncellenemedi

source: Failed to load statistics
ar: فشل تحميل الإحصائيات
tr: İstatistikler yüklenemedi

source: Failed to load active orders
ar: فشل تحميل الطلبات النشطة
tr: Aktif siparişler yüklenemedi

source: Failed to load order detail
ar: فشل تحميل تفاصيل الطلب
tr: Sipariş detayı yüklenemedi

source: Failed to load today earnings
ar: فشل تحميل أرباح اليوم
tr: Bugünkü kazançlar yüklenemedi

source: Failed to load weekly earnings
ar: فشل تحميل الأرباح الأسبوعية
tr: Haftalık kazançlar yüklenemedi

source: Failed to load monthly earnings
ar: فشل تحميل الأرباح الشهرية
tr: Aylık kazançlar yüklenemedi

source: Failed to load earnings history
ar: فشل تحميل سجل الأرباح
tr: Kazanç geçmişi yüklenemedi

source: Failed to submit proof
ar: فشل إرسال إثبات التسليم
tr: Teslimat kanıtı gönderilemedi

source: Failed to update profile
ar: فشل تحديث الملف الشخصي
tr: Profil güncellenemedi

source: Failed to upload image
ar: فشل تحميل الصورة
tr: Resim yüklenemedi

source: No file uploaded
ar: لم يتم تحميل ملف
tr: Dosya yüklenmedi

source: Internal server error during upload
ar: خطأ في الخادم أثناء التحميل
tr: Yükleme sırasında sunucu hatası oluştu

source: Check Availability
ar: التحقق من التوفر
tr: Müsaitlik Kontrolü

source: Business Settings
ar: إعدادات العمل
tr: İşletme Ayarları

source: Business Active
ar: العمل نشط
tr: İşletme Aktif

source: Customers can place orders
ar: يمكن للعملاء تقديم الطلبات
tr: Müşteriler sipariş verebilir

# orderTakingClosed
source: Order taking is closed
ar: استقبال الطلبات مغلق
tr: Sipariş alımı kapalı

source: Business Operations
ar: عمليات العمل
tr: İşletme İşlemleri

source: Minimum Order Amount
ar: الحد الأدنى للطلب
tr: Minimum Sipariş Tutarı

# estimatedDeliveryTime
source: Estimated Delivery Time (minutes)
ar: وقت التوصيل المتوقع (دقيقة)
tr: Tahmini Teslimat Süresi (dakika)

# enterValidAmount
source: Enter a valid amount
ar: أدخل مبلغاً صحيحاً
tr: Geçerli bir tutar girin

# enterValidTime
source: Enter a valid time
ar: أدخل وقتاً صحيحاً
tr: Geçerli bir süre girin

source: Optional
ar: اختياري
tr: Opsiyonel

source: Delivery Fee
ar: رسوم التوصيل
tr: Teslimat Ücreti

# addressRequiredTitle
source: Address Required
ar: العنوان مطلوب
tr: Adres Gerekli

# addressRequiredMessage
source: You need to add a delivery address before placing an order.
ar: تحتاج إلى إضافة عنوان توصيل قبل تقديم الطلب.
tr: Sipariş vermek için önce bir teslimat adresi eklemeniz gerekiyor.

# addressRequiredDescription
source: You must add at least one address to place orders. Please add your address.
ar: يجب عليك إضافة عنوان واحد على الأقل لتقديم الطلبات. يرجى إضافة عنوانك.
tr: Sipariş verebilmek için en az bir adres eklemeniz gerekmektedir. Lütfen adresinizi ekleyin.

source: Add Address
ar: إضافة عنوان
tr: Adres Ekle

source: Legal Documents
ar: الوثائق القانونية
tr: Yasal Belgeler

source: Terms of Use
ar: شروط الاستخدام
tr: Kullanım Şartları

source: Privacy Policy
ar: سياسة الخصوصية
tr: Gizlilik Politikası

source: Refund Policy
ar: سياسة الاسترداد
tr: İade ve İptal Politikası

source: Distance Sales Agreement
ar: اتفاقية البيع عن بعد
tr: Mesafeli Satış Sözleşmesi

source: Loading content...
ar: جاري تحميل المحتوى...
tr: İçerik yükleniyor...

source: Content not available
ar: المحتوى غير متوفر
tr: İçerik mevcut değil

source: Error
ar: خطأ
tr: Hata

source: Profile updated
ar: تم تحديث الملف الشخصي
tr: Profil güncellendi

# updatePersonalInfo
source: Update your personal information
ar: قم بتحديث معلوماتك الشخصية
tr: Kişisel bilgilerinizi güncelleyin

source: Phone Number
ar: رقم الهاتف
tr: Telefon Numarası

source: Profile Image URL
ar: رابط صورة الملف الشخصي
tr: Profil Resmi URL

source: Date of Birth
ar: تاريخ الميلاد
tr: Doğum Tarihi

source: Not selected
ar: غير محدد
tr: Seçilmedi
