Repository: osmanaliaydemir/talabi
Catalog: mobile/lib/l10n/app_*.arb
Languages: ar, tr

# selectCityDistrictWarning
source: Please select City and District from dropdowns to confirm.
ar: يرجى تحديد المدينة والمنطقة من القوائم للتأكيد.
tr: Lütfen onaylamak için İl ve İlçe seçiniz.

# passwordResetSuccess
source: Password reset successfully
ar: تم إعادة تعيين كلمة المرور بنجاح
tr: Şifre başarıyla sıfırlandı

source: Verification Code
ar: رمز التحقق
tr: Doğrulama Kodu

# verificationCodeSentDesc
source: Please enter the verification code sent to
ar: يرجى إدخال رمز التحقق المرسل إلى
tr: Lütfen şu adrese gönderilen doğrulama kodunu girin:

# createPassword
source: Create New Password
ar: إنشاء كلمة مرور جديدة
tr: Yeni Şifre Oluştur

# createPasswordDesc
source: Please enter a new password for your account
ar: رجأ إدخال كلمة مرور جديدة لحسابك
tr: Lütfen hesabınız için yeni bir şifre girin

# requiredField
source: This field is required
ar: هذا الحقل مطلوب
tr: Bu alan zorunludur

source: Reset Password
ar: إعادة تعيين كلمة المرور
tr: Şifreyi Sıfırla

# codeExpired
source: The code has expired.
ar: انتهت صلاحية الرمز.
tr: Kodun süresi doldu.

source: Business Type
ar: نوع العمل
tr: İşletme Türü

# businessTypeRequired
source: Business type is required
ar: نوع العمل مطلوب
tr: İşletme türü gerekli

source: Restaurant
ar: مطعم
tr: Restoran

# defaultError
source: An error occurred
ar: حدث خطأ
tr: Bir hata oluştu

# vehicleTypeRequired
source: Vehicle Type is required
ar: نوع المركبة مطلوب
tr: Araç Tipi zorunludur

# errorLoginVendorToCustomer
source: Cannot login to customer screens with a vendor account.
ar: لا يمكن تسجيل الدخول إلى شاشات العملاء بحساب بائع.
tr: Satıcı hesabıyla, müşteri ekranlarına giriş yapılamaz.

# errorLoginCourierToCustomer
source: Cannot login to customer screens with a courier account.
ar: لا يمكن تسجيل الدخول إلى شاشات العملاء بحساب سائق.
tr: Kurye hesabıyla, müşteri ekranlarına giriş yapılamaz.

# errorLoginCustomerToVendor
source: Cannot login to vendor screens with a customer account.
ar: لا يمكن تسجيل الدخول إلى شاشات البائعين بحساب عميل.
tr: Müşteri hesabıyla, satıcı ekranlarına giriş yapılamaz.

# errorLoginCourierToVendor
source: Cannot login to vendor screens with a courier account.
ar: لا يمكن تسجيل الدخول إلى شاشات البائعين بحساب سائق.
tr: Kurye hesabıyla, satıcı ekranlarına giriş yapılamaz.

# errorLoginCustomerToCourier
source: Cannot login to courier screens with a customer account.
ar: لا يمكن تسجيل الدخول إلى شاشات السائقين بحساب عميل.
tr: Müşteri hesabıyla, kurye ekranlarına giriş yapılamaz.

# errorLoginVendorToCourier
source: Cannot login to courier screens with a vendor account.
ar: لا يمكن تسجيل الدخول إلى شاشات السائقين بحساب بائع.
tr: Satıcı hesabıyla, kurye ekranlarına giriş yapılamaz.

# keywordTokenExpired
source: token expired
ar: expired
tr: süresi

# accountPendingApprovalTitle
source: Account Pending Approval
ar: الحساب قيد المراجعة
tr: Hesabınız Onay Bekliyor

# accountPendingApprovalMessage
source: Your account is currently under review. Access will be granted once your account is approved.
ar: حسابك قيد المراجعة حاليًا. سيتم منح الوصول بمجرد الموافقة على حسابك.
tr: Hesabınız şu anda incelenmektedir. Onaylandıktan sonra erişiminiz açılacaktır.

# vendorStatusBusy
source: Busy
ar: مشغول
tr: Yoğun

# vendorStatusOverloaded
source: Overloaded
ar: مزدحم جدا
tr: Çok Yoğun

# vendorStatusNormalDesc
source: Standard time
ar: الوقت القياسي
tr: Standart süre

# vendorStatusBusyDesc
source: +15 min
ar: +15 دقيقة
tr: +15 dk

# vendorStatusOverloadedDesc
source: +45 min
ar: +45 دقيقة
tr: +45 dk

source: Store Status
ar: حالة المتجر
tr: Mağaza Durumu

source: Working Hours Required
ar: ساعات العمل مطلوبة
tr: Çalışma Saatleri Zorunludur

# workingHoursRequiredDescription
source: Please set your working hours to start receiving orders.
ar: يرجى تحديد ساعات العمل لبدء تلقي الطلبات.
tr: Sipariş almaya başlamak için lütfen çalışma saatlerinizi belirleyin.

# workingHoursStart
source: Start Time
ar: وقت البدء
tr: Başlangıç Saati

# workingHoursEnd
source: End Time
ar: وقت الانتهاء
tr: Bitiş Saati

source: Select Time
ar: اختر الوقت
tr: Saat Seçin

source: Working hours updated successfully
ar: تم تحديث ساعات العمل بنجاح
tr: Çalışma saatleri başarıyla güncellendi

source: Failed to update working hours
ar: فشل تحديث ساعات العمل
tr: Çalışma saatleri güncellenemedi

source: Working Hours
ar: ساعات العمل
tr: Çalışma Saatleri

source: Working Days
ar: أيام العمل
tr: Çalışma Günleri

source: Closed
ar: مغلق
tr: Kapalı

source: Open 24 Hours
ar: مفتوح على مدار 24 ساعة
tr: 24 Saat Açık

source: Hours
ar: ساعات
tr: Saat

# workingHoursDescription
source: Manage your business opening days and hours here.
ar: إدارة أيام وساعات عمل متجرك هنا.
tr: İşletmenizin açık olduğu günleri ve saatleri buradan düzenleyebilirsiniz.

# workingHoursSaveError
source: Error saving working hours: {error}
ar: خطأ في حفظ ساعات العمل: {error}
tr: Çalışma saatleri kaydedilirken hata oluştu: {error}

# noFavoritesFound
source: No favorite products found
ar: لا توجد منتجات مفضلة
tr: Henüz favori ürününüz yok

# favoritesEmptyMessage
source: You can view your favorite products here by adding them to favorites.
ar: يمكنك عرض منتجاتك المفضلة هنا عن طريق إضافتها إلى المفضلة.
tr: Beğendiğiniz ürünleri favorilere ekleyerek burada görüntüleyebilirsiniz.

source: Sham Cash Account Number
ar: رقم حساب شام كاش
tr: Sham Cash Hesap Numarası

source: NEW OFFERS
tr: YENİ TEKLİFLER

# activeDeliveriesSectionTitle
source: ACTIVE DELIVERIES
tr: AKTİF TESLİMATLAR

source: New Order Offer!
tr: Yeni Sipariş Teklifi!

source: Viewable after acceptance
tr: Sipariş kabul edildikten sonra görüntülenebilir

# rejectReasonLabel
source: Please specify the reason for rejection:
tr: Lütfen reddetme sebebini belirtin:

# pleaseEnterReason
source: Please enter a reason
tr: Lütfen bir sebep girin

# statusAssigned
source: Assigned
tr: Atandı

# statusAccepted
source: Accepted
tr: Kabul Edildi

# statusRejected
source: Rejected
tr: Reddedildi

# statusPickedUp
source: Picked Up
tr: Teslim Alındı

# statusOutForDelivery
source: Out for Delivery
tr: Yolda

# statusDelivered
source: Delivered
tr: Teslim Edildi

source: Rate Order
tr: Siparişi Değerlendir

# rateCourier
source: Courier Rating
tr: Kurye Puanı

source: Feedback submitted successfully
tr: Değerlendirme başarıyla gönderildi

source: Order not delivered
tr: Sipariş teslim edilmedi

source: Order already reviewed
tr: Bu sipariş için zaten değerlendirme yapıldı

# popupTitle
source: Rate Order
tr: Siparişi Değerlendir

# popupMessage
source: How was your last order? Would you like to share your experience?
tr: Son siparişin nasıldı? Deneyimini paylaşmak ister misin?

source: Not Now
tr: Şimdi Değil

# viewReviews
source: View My Reviews
tr: Değerlendirmemi Gör

source: Google
ar: جوجل

source: Apple
ar: أبل

source: Facebook
ar: فيسبوك

# languageNameEn
source: English
ar: الإنجليزية

source: Minimum Rating
ar: التقييم الأدنى

source: Market
ar: سوق

# vendorStatusNormal
source: Normal
ar: عادي
