Repository: osmanaliaydemir/talabi
Catalog: mobile/lib/l10n/app_*.arb
Languages: ar, tr

source: Select Date Range
ar: اختر نطاق التاريخ
tr: Tarih Aralığı Seç

source: Daily
ar: يومي
tr: Günlük

source: Weekly
ar: أسبوعي
tr: Haftalık

source: Monthly
ar: شهري
tr: Aylık

source: No report found
ar: لم يتم العثور على تقرير
tr: Rapor bulunamadı

source: Total Orders
ar: إجمالي الطلبات
tr: Toplam Sipariş

source: Total Revenue
ar: إجمالي الإيرادات
tr: Toplam Gelir

source: Completed
ar: مكتمل
tr: Tamamlanan

# cancelledOrders
source: Cancelled
ar: الطلبات الملغاة
tr: İptal Edilen

source: Daily Sales
ar: المبيعات اليومية
tr: Günlük Satışlar

# orderCount
source: {count} orders
ar: {count} طلبات
tr: {count} sipariş

source: Refresh
ar: تحديث
tr: Yenile

source: Cancel Order
ar: إلغاء الطلب
tr: Siparişi İptal Et

source: Reorder
ar: إعادة الطلب
tr: Yeniden Sipariş Ver

source: Order cancelled
ar: تم إلغاء الطلب
tr: Sipariş iptal edildi

source: Cancel reason
ar: سبب الإلغاء
tr: İptal nedeni

# cancelReasonDescription
source: Please specify your cancellation reason (at least 10 characters):
ar: يرجى تحديد سبب الإلغاء (10 أحرف على الأقل):
tr: İptal nedeninizi belirtin (en az 10 karakter):

# acceptOrderTitle
source: Accept Order
ar: قبول الطلب
tr: Sipariş Kabul

# acceptOrderConfirmation
source: Are you sure you want to accept this order?
ar: هل أنت متأكد أنك تريد قبول هذا الطلب؟
tr: Siparişi kabul etmek istediğinizden emin misiniz?

# acceptOrder
source: Accept
ar: قبول
tr: Kabul Et

# updateOrderStatusTitle
source: Update Order Status
ar: تحديث حالة الطلب
tr: Sipariş Durumu Güncelleme

# markAsReadyConfirmation
source: Are you sure you want to mark this order as "Ready"?
ar: هل أنت متأكد أنك تريد وضع علامة "جاهز" على هذا الطلب؟
tr: Siparişi "Hazır" olarak işaretlemek istediğinizden emin misiniz?

source: Mark as Ready
ar: وضع علامة جاهز
tr: Hazır Olarak İşaretle

source: Reject Order
ar: رفض الطلب
tr: Siparişi Reddet

# rejectOrderTitle
source: Order Rejection
ar: رفض الطلب
tr: Sipariş Reddi

# rejectReason
source: Rejection reason
ar: سبب الرفض
tr: Red sebebi

# rejectReasonDescription
source: Please enter the rejection reason (at least 1 character):
ar: يرجى إدخال سبب الرفض (حرف واحد على الأقل):
tr: Red sebebinizi girin (en az 1 karakter):

# rejectReasonHint
source: Rejection reason...
ar: سبب الرفض...
tr: Red sebebi...

# rejectOrderConfirmation
source: Are you sure you want to reject this order?
ar: هل أنت متأكد أنك تريد رفض هذا الطلب؟
tr: Bu siparişi reddetmek istediğinizden emin misiniz?

source: Order rejected
ar: تم رفض الطلب
tr: Sipariş reddedildi

source: pieces
ar: قطعة
tr: adet

source: Order not found
ar: الطلب غير موجود
tr: Sipariş bulunamadı

# productsAddedToCart
source: Products added to cart, redirecting to cart...
ar: تمت إضافة المنتجات إلى السلة، جارٍ التوجيه إلى السلة...
tr: Ürünler sepete eklendi, sepete yönlendiriliyorsunuz...

# reorderFailed
source: Failed to reorder: {error}
ar: فشلت إعادة الطلب: {error}
tr: Yeniden sipariş oluşturulamadı: {error}

source: Location permission denied
ar: تم رفض إذن الموقع
tr: Konum izni reddedildi

# locationPermissionDeniedForever
source: Location permission permanently denied
ar: تم رفض إذن الموقع بشكل دائم
tr: Konum izni kalıcı olarak reddedildi

# vendorsLoadFailed
source: Failed to load vendors: {error}
ar: فشل تحميل المتاجر: {error}
tr: Marketler yüklenemedi: {error}

source: Your Location
ar: موقعك
tr: Konumunuz

# locationPermissionTitle
source: Location Permission Required
ar: إذن الموقع مطلوب
tr: Konum İzni Gerekli

# locationPermissionMessage
source: We need your location permission to show nearby restaurants and track your orders.
ar: نحتاج إلى إذن الموقع لإظهار المطاعم القريبة وتتبع طلباتك.
tr: Uygulamanın size yakın restoranları gösterebilmesi ve siparişlerinizi takip edebilmesi için konum iznine ihtiyacımız var.

source: Allow
ar: السماح
tr: İzin Ver

source: Location Management
ar: إدارة الموقع
tr: Konum Yönetimi

# currentLocationInfo
source: Current Location Information
ar: معلومات الموقع الحالي
tr: Mevcut Konum Bilgisi

source: Latitude
ar: خط العرض
tr: Enlem

source: Longitude
ar: خط الطول
tr: Boylam

# lastLocationUpdate
source: Last Update
ar: آخر تحديث
tr: Son Güncelleme

# noLocationData
source: No location data available
ar: لا توجد بيانات موقع
tr: Henüz konum bilgisi yok

source: Select Location on Map
ar: حدد الموقع على الخريطة
tr: Haritada Konum Seç

source: Use Current Location
ar: استخدم الموقع الحالي
tr: Mevcut Konumu Kullan

source: Update Location
ar: تحديث الموقع
tr: Konumu Güncelle

# locationSharingInfo
source: Location sharing is required to receive orders from nearby restaurants. Your location is automatically shared when your status is "Available".
ar: مشاركة الموقع مطلوبة لتلقي الطلبات من المطاعم القريبة. تتم مشاركة موقعك تلقائيًا عندما تكون حالتك "متاح".
tr: Konum paylaşımı, yakınındaki restoranlardan sipariş alabilmen için gereklidir. Durumun "Available" olduğunda konumun otomatik olarak paylaşılır.

# locationManagementDescription
source: View and update your current location
ar: عرض وتحديث موقعك الحالي
tr: Mevcut konumunu görüntüle ve güncelle

source: Vendors Map
ar: خريطة المتاجر
tr: Marketler Haritası

source: Find My Location
ar: العثور على موقعي
tr: Konumumu Bul

source: View Products
ar: عرض المنتجات
tr: Ürünleri Görüntüle

source: Getting location...
ar: جارٍ الحصول على الموقع...
tr: Konum alınıyor...

# searchError
source: Search error: {error}
ar: خطأ في البحث: {error}
tr: Arama hatası: {error}

# productAddedToCart
source: {productName} added to cart
ar: تمت إضافة {productName} إلى السلة
tr: {productName} sepete eklendi

source: Filters
ar: المرشحات
tr: Filtreler

source: Clear
ar: مسح
tr: Temizle

source: Select category
ar: اختر الفئة
tr: Kategori seçin

source: Price Range
ar: نطاق السعر
tr: Fiyat Aralığı

source: Min Price
ar: الحد الأدنى للسعر
tr: Min Fiyat

source: Max Price
ar: الحد الأقصى للسعر
tr: Max Fiyat

source: Select city
ar: اختر المدينة
tr: Şehir seçin

# maximumDistance
source: Maximum Distance (km)
ar: الحد الأقصى للمسافة (كم)
tr: Maksimum Mesafe (km)

source: Distance (km)
ar: المسافة (كم)
tr: Mesafe (km)

source: Sort By
ar: ترتيب حسب
tr: Sıralama

source: Select sort by
ar: اختر الترتيب
tr: Sıralama seçin

source: Price (Low to High)
ar: السعر (من الأقل إلى الأعلى)
tr: Fiyat (Düşükten Yükseğe)

source: Price (High to Low)
ar: السعر (من الأعلى إلى الأقل)
tr: Fiyat (Yüksekten Düşüğe)

source: Sort by Name
ar: ترتيب حسب الاسم
tr: İsme Göre

source: Newest
ar: الأحدث
tr: En Yeni

source: Rating (High to Low)
ar: التقييم (من الأعلى إلى الأقل)
tr: Rating (Yüksekten Düşüğe)

source: Popularity
ar: الشعبية
tr: Popülerlik

source: Distance
ar: المسافة
tr: Mesafe

source: Apply Filters
ar: تطبيق المرشحات
tr: Filtreleri Uygula

source: Search products or vendors...
ar: ابحث عن المنتجات أو المتاجر...
tr: Ürün veya market ara...

source: Suggestions
ar: الاقتراحات
tr: Öneriler

source: Product
ar: منتج
tr: Ürün

source: Search History
ar: سجل البحث
tr: Arama Geçmişi

# typeToSearch
source: Type in the box above to search
ar: اكتب في المربع أعلاه للبحث
tr: Arama yapmak için yukarıdaki kutuya yazın

source: Recent Searches
ar: عمليات البحث الأخيرة
tr: Son Aramalar

source: No results found
ar: لم يتم العثور على نتائج
tr: Sonuç bulunamadı

# cityLabel
source: City: {city}
ar: المدينة: {city}
tr: Şehir: {city}

# distanceLabel
source: Distance: {distance} km
ar: المسافة: {distance} كم
tr: Mesafe: {distance} km

source: Popular Searches
ar: عمليات البحث الشائعة
tr: Popüler Aramalar

# removedFromFavorites
source: {productName} removed from favorites
ar: تمت إزالة {productName} من المفضلة
tr: {productName} favorilerden çıkarıldı

source: Delivery Zones
ar: مناطق التوصيل
tr: Teslimat Bölgeleri

# deliveryZonesDescription
source: Manage cities and districts you deliver to
ar: إدارة المدن والمناطق التي تقوم بالتوصيل إليها
tr: Teslimat yaptığınız şehir ve ilçeleri yönetin

# deliveryZonesUpdated
source: Delivery zones updated successfully
ar: تم تحديث مناطق التوصيل بنجاح
tr: Teslimat bölgeleri başarıyla güncellendi

# addedToFavorites
source: {productName} added to favorites
ar: تمت إضافة {productName} إلى المفضلة
tr: {productName} favorilere eklendi

# favoriteOperationFailed
source: Favorite operation failed: {error}
ar: فشلت عملية المفضلة: {error}
tr: Favori işlemi başarısız: {error}

source: No products yet.
ar: لا توجد منتجات بعد.
tr: Henüz ürün yok.

# productLoadFailed
source: Failed to load product: {error}
ar: فشل تحميل المنتج: {error}
tr: Ürün yüklenemedi: {error}

source: Product not found
ar: المنتج غير موجود
tr: Ürün bulunamadı

source: Rate Vendor
ar: تقييم المتجر
tr: Vendor'u Değerlendir

source: Share your thoughts...
ar: شارك أفكارك...
tr: Düşüncelerinizi paylaşın...

source: Submit
ar: إرسال
tr: Gönder

source: Vendor review submitted!
ar: تم إرسال تقييم المتجر!
tr: Vendor değerlendirmesi gönderildi!

source: Product review submitted!
ar: تم إرسال تقييم المنتج!
tr: Ürün değerlendirmesi gönderildi!

# noDescription
source: No description available.
ar: لا يوجد وصف متاح.
tr: Açıklama bulunmuyor.

source: Read more
ar: اقرأ المزيد
tr: Daha fazla oku

source: Show less
ar: عرض أقل
tr: Daha az göster

source: Delivery Time
ar: وقت التسليم
tr: Teslimat Süresi

source: Delivery Type
ar: نوع التسليم
tr: Teslimat Türü

# reviewsTitle
source: Reviews
tr: Değerlendirmeler

# reviews
source: Reviews ({count})
ar: المراجعات ({count})
tr: Yorumlar ({count})

# noReviewsYet
source: No reviews yet. Be the first to review!
ar: لا توجد مراجعات بعد. كن أول من يراجع!
tr: Henüz yorum yok. İlk yorumu siz yapın!

source: See All Reviews
ar: عرض جميع المراجعات
tr: Tüm Yorumları Gör

# by
source: By {vendorName}
ar: بواسطة: {vendorName}
tr: Tarafından: {vendorName}

# orderCreatedSuccessfully
source: Your Order Has Been Created Successfully!
ar: تم إنشاء طلبك بنجاح!
tr: Siparişiniz Başarıyla Oluşturuldu!

source: Order Code
ar: رمز الطلب
tr: Sipariş Kodu

# orderPreparationStarted
source: Your order has started being prepared. You can track your order status from the "My Orders" page.
ar: بدأ تحضير طلبك. يمكنك تتبع حالة طلبك من صفحة "طلباتي".
tr: Siparişiniz hazırlanmaya başlandı. Sipariş durumunuzu "Siparişlerim" sayfasından takip edebilirsiniz.

# homePage
source: Home
ar: الرئيسية
tr: Ana Sayfa

# ordersLoadFailed
source: Failed to load orders: {error}
ar: فشل تحميل الطلبات: {error}
tr: Siparişler yüklenemedi: {error}

source: No orders yet
ar: لا توجد طلبات بعد
tr: Henüz siparişiniz yok

source: Unknown Vendor
ar: متجر غير معروف
tr: Bilinmeyen Satıcı

source: Unknown
ar: غير معروف
tr: Bilinmeyen

source: Cancel Item
ar: إلغاء المنتج
tr: Ürünü İptal Et

source: Item Cancelled
ar: تم إلغاء المنتج
tr: Ürün İptal Edildi

# itemCancelSuccess
source: Item cancelled successfully
ar: تم إلغاء المنتج بنجاح
tr: Ürün başarıyla iptal edildi

# itemCancelFailed
source: Failed to cancel item: {error}
ar: فشل إلغاء المنتج: {error}
tr: Ürün iptal edilemedi: {error}

# promotionalBannerTitle
source: Hungry? Weve got you covered!
ar: جائع؟ نحن نلبي احتياجاتك!
tr: Acıktınız mı? Sizi düşündük!

# promotionalBannerSubtitle
source: Free delivery, low fees & 10% cashback!
ar: توصيل مجاني، رسوم منخفضة و 10% استرداد نقدي!
tr: Ücretsiz teslimat, düşük ücretler & %10 nakit iade!

source: Order Now
ar: اطلب الآن
tr: Sipariş Ver

source: Categories
ar: الفئات
tr: Kategoriler

# categoryNotFound
source: No categories found
ar: لم يتم العثور على فئات
tr: Kategori bulunamadı

source: Picks For You
ar: اختياراتنا لك
tr: Sizin İçin Seçtiklerimiz

# addressUpdateFailed
source: Address update failed: {error}
ar: فشل تحديث العنوان: {error}
tr: Adres güncellenemedi: {error}

# unreadNotificationsCount
source: {count} unread notifications
ar: {count} إشعارات غير مقروءة
tr: {count} okunmamış bildirim

source: Campaigns
ar: الحملات
tr: Kampanyalar

# productsCount
source: {count} products
ar: {count} منتجات
tr: {count} ürün

# campaignsCount
source: {count} campaigns
ar: {count} حملات
tr: {count} kampanya

# vendorsCount
source: {count} businesses
ar: {count} شركات
tr: {count} işletme

source: Similar Products
ar: منتجات مماثلة
tr: Benzer Ürünler

source: Are you Hungry?
ar: هل أنت جائع؟
tr: Acıktınız mı?

# onboardingDescription
source: Request what you need, and we'll deliver it to you as fast as possible. Ordering with Talabi is now as easy as a single touch.
ar: اطلب ما تحتاجه، وسنقوم بتوصيله إليك في أسرع وقت ممكن. الطلب مع طلبي أصبح الآن سهلاً بلمسة واحدة.
tr: İhtiyacını talep et, en hızlı şekilde sana ulaştıralım. Sipariş vermek artık tek dokunuş kadar kolay.

# unlockDescription
source: Slide to Talab!
ar: انزلق إلى الطالبي!
tr: Talabî'ye doğru kaydırın!

source: Add address to order
ar: أضف عنوانًا للطلب
tr: Sipariş vermek için adres ekleyin

source: Create Courier Account
ar: إنشاء حساب السائق
tr: Kurye Hesabı Oluştur

# startDeliveringToday
source: Start delivering today and earn money
ar: ابدأ التسليم اليوم وكسب المال
tr: Bugün teslimata başla ve para kazan

# alreadyHaveCourierAccount
source: Already have a courier account?
ar: هل لديك بالفعل حساب سائق؟
tr: Zaten kurye hesabınız var mı?

source: Courier Register
ar: تسجيل السائق
tr: Kurye Kaydı

source: Talabi Courier
ar: طلبي السائق
tr: Talabi Kurye

source: Today
ar: اليوم
tr: Bugün

source: All time
ar: كل الأوقات
tr: Tüm zamanlar

source: Accept
ar: قبول
tr: Kabul Et

source: Mark as Picked Up
ar: تم الاستلام
tr: Alındı Olarak İşaretle

source: Mark as Delivered
ar: تم التسليم
tr: Teslim Edildi Olarak İşaretle

source: Order accepted
ar: تم قبول الطلب
tr: Sipariş kabul edildi

source: Order marked as picked up
ar: تم تحديد الطلب كمستلم
tr: Sipariş alındı olarak işaretlendi

source: Order delivered
ar: تم تسليم الطلب
tr: Sipariş teslim edildi

source: Action could not be completed
ar: لم يتم إكمال الإجراء
tr: İşlem tamamlanamadı

source: Cannot change status while busy
ar: لا يمكن تغيير الحالة أثناء الانشغال
tr: Meşgulken durum değiştirilemez

# newOrderAssigned
source: New order #{orderId} assigned!
ar: تم تعيين طلب جديد #{orderId}!
tr: Yeni sipariş #{orderId} atandı!

source: Current Status
ar: الحالة الحالية
tr: Anlık Durum

source: Performance
ar: الأداء
tr: Performans

source: Availability Status
ar: حالة التوفر
tr: Müsaitlik Durumu

# checkNewOrderConditions
source: Check new order receiving conditions here
ar: تحقق من شروط استلام الطلبات الجديدة هنا
tr: Yeni sipariş alabilme şartlarını buradan kontrol et

source: Navigation App
ar: تطبيق الملاحة
tr: Navigasyon Uygulaması

# selectPreferredNavigationApp
source: Select your preferred navigation app
ar: اختر تطبيق الملاحة المفضل لديك
tr: Tercih ettiğin navigasyon uygulamasını seç

# noVehicleInfo
source: No vehicle information
ar: لا توجد معلومات عن المركبة
tr: Araç bilgisi yok

source: Cannot change status with active orders
ar: لا يمكن تغيير الحالة مع وجود طلبات نشطة
tr: Aktif sipariş varken durum değiştirilemez

# cannotGoOfflineUntilOrdersCompleted
source: Cannot go offline until active orders are completed
ar: لا يمكنك الانتقال إلى وضع عدم الاتصال حتى اكتمال الطلبات النشطة
tr: Aktif sipariş tamamlanana kadar offline olamazsın

source: Points
ar: النقاط
tr: Puan

source: Total Earnings
ar: إجمالي الأرباح
tr: Toplam Kazanç

# logoutConfirm
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
tr: Çıkış yapmak istediğine emin misin?

# personalInfo
source: Personal Information
ar: المعلومات الشخصية
tr: Kişisel Bilgiler

source: Courier Settings
ar: إعدادات السائق
tr: Kurye Ayarları

source: Vehicle Type
ar: نوع المركبة
tr: Araç Türü

source: Max Active Orders
ar: الحد الأقصى للطلبات النشطة
tr: Maksimum Aktif Sipariş

source: Use working hours
ar: استخدام ساعات العمل
tr: Çalışma saatlerini kullan

# onlyAvailableDuringSetHours
source: You can only be "Available" during the hours you set
ar: يمكنك أن تكون "متاح" فقط خلال الساعات التي تحددها
tr: Sadece belirlediğin saatlerde "Müsait" olabilirsin

source: Start Time
ar: وقت البداية
tr: Başlangıç Saati

source: End Time
ar: وقت النهاية
tr: Bitiş Saati

# mustSelectStartAndEndTime
source: You must select start and end time for working hours
ar: يجب تحديد وقت البداية والنهاية لساعات العمل
tr: Çalışma saatleri için başlangıç ve bitiş seçmelisin

source: Saving...
ar: جاري الحفظ...
tr: Kaydediliyor...

# mustSelectVehicleType
source: You must select a vehicle type
ar: يجب تحديد نوع المركبة
tr: Araç türü seçmelisin

source: Select Vehicle Type
ar: اختر نوع المركبة
tr: Araç Türü Seçin

# selectVehicleTypeDescription
source: Please select the vehicle type you will use. This selection is required.
ar: يرجى تحديد نوع المركبة التي ستستخدمها. هذا الاختيار إلزامي.
tr: Lütfen kullanacağınız araç türünü seçin. Bu seçim zorunludur.

source: Motorcycle
ar: دراجة نارية
tr: Motor

source: Car
ar: سيارة
tr: Araba

source: Bicycle
ar: دراجة
tr: Bisiklet

source: Vehicle type updated successfully
ar: تم تحديث نوع المركبة بنجاح
tr: Araç türü başarıyla güncellendi

source: Failed to update vehicle type
ar: فشل تحديث نوع المركبة
tr: Araç türü güncellenemedi

# selectLocationRequired
source: Location Selection Required
ar: اختيار الموقع إلزامي
tr: Konum Seçimi Zorunlu

# selectLocationRequiredDescription
source: Please select your location. This information is required to receive orders.
ar: يرجى تحديد موقعك. هذه المعلومات مطلوبة لتلقي الطلبات.
tr: Lütfen konumunuzu seçin. Bu bilgi sipariş almak için gereklidir.

source: Select from Map
ar: اختيار من الخريطة
tr: Haritadan Seç

# gettingCurrentLocation
source: Getting your location...
ar: جارٍ الحصول على موقعك...
tr: Konumunuz alınıyor...

# locationServicesDisabledTitle
source: Location Services Disabled
ar: خدمات الموقع معطلة
tr: Konum Servisleri Kapalı

# locationServicesDisabledMessage
source: Location services are disabled. Please enable location services in settings.
ar: خدمات الموقع معطلة. يرجى تفعيل خدمات الموقع من الإعدادات.
tr: Konum servisleri kapalı. Lütfen ayarlardan konum servislerini açın.

source: Open Settings
ar: فتح الإعدادات
tr: Ayarları Aç

# assignCourierConfirmationTitle
source: Confirm Courier Assignment
ar: تأكيد تعيين الكوريير
tr: Kurye Atamasını Onayla

# assignCourierConfirmationMessage
source: Are you sure you want to assign this order to {courierName}?
ar: هل أنت متأكد من أنك تريد تعيين هذا الطلب إلى {courierName}؟
tr: {courierName} adlı kuryeye bu siparişi atamak istediğinize emin misiniz?

source: Assign
ar: تعيين
tr: Ata

source: Courier assigned successfully
ar: تم تعيين الكوريير بنجاح
tr: Kurye başarıyla atandı

# enterValidNumber
source: Enter a valid number
ar: أدخل رقمًا صالحًا
tr: Geçerli bir sayı gir

# profileUpdateFailed
source: Profile update failed: {error}
ar: فشل تحديث الملف الشخصي: {error}
tr: Profil güncellenemedi: {error}

source: Availability Conditions
ar: شروط التوفر
tr: Müsaitlik Koşulları

# whenConditionsMetCanReceiveOrders
source: The following conditions must be met to receive new orders:
ar: يجب استيفاء الشروط التالية لاستلام طلبات جديدة:
tr: Aşağıdaki şartlar sağlandığında yeni sipariş atanabilir:

# statusMustBeAvailable
source: Your status must be "Available"
ar: يجب أن تكون حالتك "متاح"
tr: Durumun "Available / Müsait" olmalı

# activeOrdersBelowLimit
source: Your active orders must be below your maximum limit ({current} / {max})
ar: يجب أن تكون طلباتك النشطة أقل من الحد الأقصى ({current} / {max})
tr: Aktif sipariş sayın, maksimum limitin altında olmalı ({current} / {max})

# courierAccountMustBeActive
source: Your courier account must be active
ar: يجب أن يكون حساب السائق نشطًا
tr: Kurye hesabın aktif olmalı

source: Currently blocking reasons
ar: الأسباب التي تمنع حاليًا
tr: Şu anda engelleyen nedenler

# everythingLooksGood
source: Everything looks good, new orders may arrive
ar: يبدو كل شيء على ما يرام، قد تصل طلبات جديدة
tr: Her şey yolunda görünüyor, yeni siparişler gelebilir

source: Available
ar: متاح
tr: Müsait

source: Not Available
ar: غير متاح
tr: Müsait Değil

# earningsTitle
source: Earnings
ar: الأرباح
tr: Kazançlar

# todayEarnings
source: Today
ar: اليوم
tr: Bugün

source: This Week
ar: هذا الأسبوع
tr: Bu Hafta

source: This Month
ar: هذا الشهر
tr: Bu Ay

# totalEarningsLabel
source: Total Earnings
ar: إجمالي الأرباح
tr: Toplam Kazanç

source: Avg. per Delivery
ar: متوسط لكل تسليم
tr: Teslimat Başına Ortalama

source: History
ar: السجل
tr: Geçmiş

# noEarningsForPeriod
source: No earnings found for this period
ar: لم يتم العثور على أرباح لهذه الفترة
tr: Bu dönem için kazanç bulunamadı

source: Navigation app updated
ar: تم تحديث تطبيق الملاحة
tr: Navigasyon uygulaması güncellendi

# navigationPreferenceNotSaved
source: Navigation preference could not be saved: {error}
ar: لم يتم حفظ تفضيل الملاحة: {error}
tr: Navigasyon tercihi kaydedilemedi: {error}

# selectDefaultNavigationApp
source: Select the default navigation app you want to use when going to delivery address
ar: اختر تطبيق الملاحة الافتراضي الذي تريد استخدامه عند الذهاب إلى عنوان التسليم
tr: Teslimat adresine giderken kullanmak istediğin varsayılan navigasyon uygulamasını seç

source: Note
ar: ملاحظة
tr: Not

# ifAppNotInstalledSystemWillOfferAlternative
source: If the app you selected is not installed, the system will offer you a suitable alternative
ar: إذا لم يكن التطبيق الذي اخترته مثبتًا، فسيقدم لك النظام بديلاً مناسبًا
tr: Seçtiğin uygulama cihazında yüklü değilse sistem sana uygun bir seçenek sunar

# preferenceOnlyForCourierAccount
source: This preference is only valid for your courier account
ar: هذا التفضيل صالح فقط لحساب السائق الخاص بك
tr: Bu tercih sadece kurye hesabın için geçerlidir

# notificationsTitle
source: Notifications
ar: الإشعارات
tr: Bildirimler

# noNotificationsYet
source: You don't have any notifications yet. Order movements will appear here
ar: ليس لديك أي إشعارات حتى الآن. ستظهر حركات الطلب هنا
tr: Henüz bir bildirimin yok. Sipariş hareketlerin burada görünecek

# notificationsLoadFailed
source: Notifications could not be loaded
ar: فشل تحميل الإشعارات
tr: Bildirimler yüklenemedi

# notificationProcessingFailed
source: Notification processing failed: {error}
ar: فشل معالجة الإشعار: {error}
tr: Bildirim işlenemedi: {error}

# orderDetailTitle
source: Order Detail
ar: تفاصيل الطلب
tr: Sipariş Detayı

source: Pickup Location
ar: موقع الاستلام
tr: Alış Konumu

source: Delivery Location
ar: موقع التسليم
tr: Teslimat Konumu

source: Order Items
ar: عناصر الطلب
tr: Sipariş Ürünleri

source: View Map
ar: عرض الخريطة
tr: Haritayı Görüntüle

source: Delivery Proof
ar: إثبات التسليم
tr: Teslimat Kanıtı

source: Take Photo
ar: التقاط صورة
tr: Fotoğraf Çek

source: Signature
ar: التوقيع
tr: İmza

source: Notes
ar: ملاحظات
tr: Notlar

source: Notes (Optional)
ar: ملاحظات (اختياري)
tr: Notlar (Opsiyonel)

# leftAtFrontDoor
source: Left at front door, etc.
ar: ترك عند الباب الأمامي، إلخ
tr: Kapı önüne bırakıldı, vb.

# submitProofAndCompleteDelivery
source: Submit Proof & Complete Delivery
ar: إرسال الإثبات وإكمال التسليم
tr: Kanıt Gönder ve Teslimatı Tamamla

# pleaseTakePhoto
source: Please take a photo of the delivery
ar: يرجى التقاط صورة للتسليم
tr: Lütfen teslimatın fotoğrafını çekin

# pleaseObtainSignature
source: Please obtain a signature
ar: يرجى الحصول على توقيع
tr: Lütfen imza alın

source: Try Again
ar: حاول مرة أخرى
tr: Tekrar dene

source: No delivery history yet
ar: لا يوجد سجل تسليم حتى الآن
tr: Henüz teslimat geçmişi yok

source: Pickup
ar: الاستلام
tr: Alış

source: Delivery
ar: التسليم
tr: Teslimat

source: Navigate
ar: التنقل
tr: Yönlendir

# couldNotLaunchMaps
source: Could not launch maps: {error}
ar: تعذر فتح الخرائط: {error}
tr: Haritalar açılamadı: {error}

# marketBannerTitle
source: Market Shopping at Your Door
ar: تبضّع من الماركت لباب بيتك
tr: Market Alışverişin Kapında

source: Select Country
ar: اختر الدولة
tr: Ülke Seçiniz

source: Locality / Neighborhood
ar: المنطقة / الحي
tr: Mahalle
